[
    {
        "SafeguardID":  "SG1.1",
        "Level":  "Level 1",
        "Description":  "No comprehensive inventory of enterprise assets exists, including end-user devices, network devices, non-computing/IoT devices, and servers.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG1.1",
        "Level":  "Level 2",
        "Description":  "An incomplete inventory is maintained, with some assets listed but lacking essential details such as hardware address or department ownership. Review and update process is not regularly conducted.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG1.1",
        "Level":  "Level 3",
        "Description":  "A basic inventory of enterprise assets exists, including the required fields (network address, hardware address, machine name, etc.). However, review and update frequency may be infrequent, leading to outdated information.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG1.1",
        "Level":  "Level 4",
        "Description":  "An accurate, detailed, and regularly reviewed inventory of all enterprise assets is maintained, including mobile devices supported by MDM tools. All assets are accounted for, and the inventory is updated at least bi-annually or more frequently.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.1",
        "Level":  "Level 1",
        "Description":  "The organization has no established process to track its licensed software, and there is no centralized inventory system in place.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.1",
        "Level":  "Level 2",
        "Description":  "The organization has a basic inventory of some licensed software, but it lacks essential details such as publisher information or version numbers. The inventory is not regularly reviewed or updated.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.1",
        "Level":  "Level 3",
        "Description":  "The organization has a comprehensive software inventory with most required fields filled out for each application, but some details are missing (e.g., business purpose or decommission date). The inventory is reviewed and updated quarterly.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.1",
        "Level":  "Level 4",
        "Description":  "The organization maintains an accurate and complete software inventory of all licensed applications, including all required fields and bi-annual reviews. All licenses are up to date, and decommissioned assets are properly accounted for.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.1",
        "Level":  "Level 1",
        "Description":  "There is no established data management process. Data handling, retention, and disposal practices vary across departments, lacking a centralized standard.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.1",
        "Level":  "Level 2",
        "Description":  "A basic documented process exists, but it lacks essential details on data sensitivity, owner roles, and enterprise standards. Annual review is not conducted, and updates are sporadic.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.1",
        "Level":  "Level 3",
        "Description":  "A documented process exists, addressing key aspects of data management. However, gaps remain in handling sensitive data, retention limits, and disposal requirements, which require immediate attention to ensure compliance.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.1",
        "Level":  "Level 4",
        "Description":  "A comprehensive, well-documented data management process is established, adhering to enterprise standards for sensitivity, owner roles, and retention/retirement procedures. The process is reviewed and updated annually, ensuring continuous compliance with evolving enterprise requirements.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.1",
        "Level":  "Level 1",
        "Description":  "There is no documented secure configuration process in place for enterprise assets and software.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.1",
        "Level":  "Level 2",
        "Description":  "A basic document exists, but it lacks detail and specificity regarding the configuration requirements and procedures for various asset types and software components.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.1",
        "Level":  "Level 3",
        "Description":  "Some aspects of the configuration process are documented and implemented, such as server configurations or endpoint security settings, but gaps exist in coverage for other critical assets or software.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.1",
        "Level":  "Level 4",
        "Description":  "A detailed, well-maintained document outlines secure configuration procedures for all enterprise assets, including portable devices, non-computing/IoT devices, operating systems, and applications. Regular updates ensure ongoing compliance with changing enterprise requirements.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.2",
        "Level":  "Level 1",
        "Description":  "No secure configuration process exists for network devices. Lack of documentation and no regular reviews or updates are in place.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.2",
        "Level":  "Level 2",
        "Description":  "A basic documented secure configuration process exists, but is not reviewed annually or updated after significant enterprise changes.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.2",
        "Level":  "Level 3",
        "Description":  "A comprehensive secure configuration process is established and regularly reviewed (at least annually) to ensure it remains effective. Updates are made as needed.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.2",
        "Level":  "Level 4",
        "Description":  "A secure configuration process for network devices is documented, up-to-date, accurate and detailed.  Includes firmware version, date of release, modules/components in use, ports enabled and list of administrative access.  Reviewed annually or more frequently as needed.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.1",
        "Level":  "Level 1",
        "Description":  "No inventory of accounts exists, no tracking of user, administrator, and service accounts.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.1",
        "Level":  "Level 2",
        "Description":  "A basic spreadsheet tracks account information (name, username, start/stop dates) but lacks regular validation and authorization checks.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.1",
        "Level":  "Level 3",
        "Description":  "A comprehensive inventory of all accounts is maintained, including periodic quarterly reviews and updates. All active accounts are validated against approved lists.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.1",
        "Level":  "Level 4",
        "Description":  "An automated inventory system tracks account information, schedules recurring validation runs (e.g., daily), and ensures authorized access to accounts through a centralized control framework.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.2",
        "Level":  "Level 1",
        "Description":  "No specific guidelines exist for generating unique passwords, making it vulnerable to weak passwords and potential breaches.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.2",
        "Level":  "Level 2",
        "Description":  "Weak passwords are used, often with fewer than 8 characters, increasing the risk of unauthorized access. Passwords may be reused across multiple accounts.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.2",
        "Level":  "Level 3",
        "Description":  "Enterprise assets use a minimum of an 8-character password for MFA accounts and a minimum of a 14-character password for non-MFA accounts. This provides some level of security, but vulnerabilities remain.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.2",
        "Level":  "Level 4",
        "Description":  "Every password is unique across all enterprise assets.  A minimum of 8-character password with MFA, or a minimum 14-character password where MFA is not used are implementeds, ensuring robust security and minimizing risks of unauthorized access.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.1",
        "Level":  "Level 1",
        "Description":  "No established process exists for granting access to enterprise assets. Access is granted manually and inconsistently.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.1",
        "Level":  "Level 2",
        "Description":  "A manual, unautomated process is in place for granting access, but documentation is lacking or incomplete. Audits are not regularly performed.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.1",
        "Level":  "Level 3",
        "Description":  "An automated process has been established for granting access to enterprise assets, with clear documentation and regular audits. Access reviews occur quarterly.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.1",
        "Level":  "Level 4",
        "Description":  "A fully automated, role-based access control system is in place, with comprehensive documentation and regular audits performed at least monthly. All users have a single point of accountability for their access privileges.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.2",
        "Level":  "Level 1",
        "Description":  "No process exists for revoking access to enterprise assets upon termination or role change. Access is maintained indefinitely, potentially leading to unauthorized access and data breaches.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.2",
        "Level":  "Level 2",
        "Description":  "A manual process exists for revoking access in some cases, but it may not be automated or consistently applied. This can result in inconsistent access control and potential security risks.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.2",
        "Level":  "Level 3",
        "Description":  "An automated process is in place for revoking access in most situations, including terminations and role changes. However, there may be exceptions or workarounds that allow unauthorized access to remain active. This level of compliance provides some basic protection but leaves room for improvement.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.2",
        "Level":  "Level 4",
        "Description":  "A fully automated process exists for revoking access to enterprise assets upon termination or role change, including disabling accounts to preserve audit trails. All exceptions are documented and tracked, ensuring consistent and secure access control throughout the organization.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.1",
        "Level":  "Level 1",
        "Description":  "No documented vulnerability management process exists. The organization does not have a formal procedure for identifying, classifying, and remediating vulnerabilities in its enterprise assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.1",
        "Level":  "Level 2",
        "Description":  "A basic vulnerability scan is performed annually, but no documentation or reporting is maintained to track results. The organization has some awareness of vulnerabilities but lacks a structured process.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.1",
        "Level":  "Level 3",
        "Description":  "A documented vulnerability management process exists and is reviewed annually. However, the process may not be comprehensive, and remediation efforts are not always effective in mitigating identified risks.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.1",
        "Level":  "Level 4",
        "Description":  "A robust, documented vulnerability management process is established and maintained, with regular scans, thorough risk assessments, and effective remediation measures in place. Documentation is accurate, complete, and regularly updated to reflect changes in enterprise assets or security posture.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.2",
        "Level":  "Level 1",
        "Description":  "No remediation process exists, and there are no regular reviews to identify and address vulnerabilities.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.2",
        "Level":  "Level 2",
        "Description":  "A basic remediation process is in place, but it lacks a risk-based approach and review schedule; only minor issues are addressed on an ad-hoc basis.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.2",
        "Level":  "Level 3",
        "Description":  "A remediation process exists, with a risk-based approach and regular reviews (monthly or more frequently); however, some vulnerabilities may not be identified or addressed promptly.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.2",
        "Level":  "Level 4",
        "Description":  "A comprehensive remediation process is in place, with a risk-based approach and frequent reviews; all identified vulnerabilities are assessed and addressed promptly, and the process is regularly reviewed and updated to ensure effectiveness.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.1",
        "Level":  "Level 1",
        "Description":  "No documented audit log management process exists, nor are there any logging requirements defined.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.1",
        "Level":  "Level 2",
        "Description":  "A basic audit log management process is in place, but it only addresses the collection and review of logs for a limited set of enterprise assets. Documentation is not reviewed or updated annually.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.1",
        "Level":  "Level 3",
        "Description":  "A documented audit log management process defines the enterprise\u0027s logging requirements, including the collection, review, and retention of audit logs for all critical enterprise assets. The process is reviewed and updated annually to reflect changes that could impact this Safeguard.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.1",
        "Level":  "Level 4",
        "Description":  "The enterprise has a comprehensive audit log management process in place, defining detailed logging requirements for all enterprise assets, including user activity, system changes, and security events. Documentation is regularly reviewed, updated, and verified to ensure compliance with established guidelines.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.1",
        "Level":  "Level 1",
        "Description":  "No documented data recovery process exists, and there are no procedures in place to recover data from backups or other means.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.1",
        "Level":  "Level 2",
        "Description":  "A basic written documentation of the data recovery process is created, but it lacks detail on scope, prioritization, and security. Review and update annually, with no consideration for enterprise changes.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.1",
        "Level":  "Level 3",
        "Description":  "A comprehensive, documented data recovery process exists that addresses scope, prioritization, and security. The process is reviewed and updated annually, taking into account significant enterprise changes. However, documentation is not consistently enforced or followed.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.1",
        "Level":  "Level 4",
        "Description":  "A robust, documented data recovery process is established, reviewed, and updated annually, with consideration for all significant enterprise changes. The process is enforced through regular audits and training, ensuring that all personnel understand their roles in the data recovery process.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.1",
        "Level":  "Level 1",
        "Description":  "No formal inventory exists for service providers. Service providers are contacted as needed without a centralized list.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.1",
        "Level":  "Level 2",
        "Description":  "A basic inventory is created listing known service providers, but lacks classification and enterprise contact information. The list is reviewed and updated annually.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.1",
        "Level":  "Level 3",
        "Description":  "An inventory is established with classified information for each service provider, including an assigned enterprise contact. The list is reviewed and updated annually or when significant changes occur.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.1",
        "Level":  "Level 4",
        "Description":  "A documented inventory of service providers exists and includes all necessary information, including a list of all known service providers, includes classification and contains an enterprise contact for each service provider.  The inventory is reviewed annually or more frequently.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG17.3",
        "Level":  "Level 1",
        "Description":  "No documented enterprise process exists for reporting security incidents. There is no designated personnel to report to and the mechanism for reporting is not established.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG17.3",
        "Level":  "Level 2",
        "Description":  "A basic process exists, but it lacks clarity on minimum information to be reported and does not specify a publically available reporting mechanism. Incident reports are not reviewed annually or in response to significant enterprise changes.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG17.3",
        "Level":  "Level 3",
        "Description":  "An enterprise process for reporting security incidents is established, including designated personnel to report to and a method for reporting. However, the review process is limited to once every two years, or when required by senior management. The process is not publicly available to all workforce members.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG17.3",
        "Level":  "Level 4",
        "Description":  "A comprehensive enterprise process for reporting security incidents exists, including clear minimum information requirements, public availability, and a regular review schedule (annually) that takes into account significant enterprise changes. Incident reports are thoroughly reviewed to ensure effective incident response and mitigation.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG1.2",
        "Level":  "Level 1",
        "Description":  "No process exists to address unauthorized assets on a weekly basis. There is no documentation or evidence of efforts to identify and mitigate risks posed by these assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG1.2",
        "Level":  "Level 2",
        "Description":  "The organization has some awareness of unauthorized assets, but lacks a consistent process to address them. Procedures exist, but are not followed or implemented consistently.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG1.2",
        "Level":  "Level 3",
        "Description":  "Unauthorized assets remain active on the network due to inconsistent remediation efforts. Some measures are taken, but documentation and enforcement are lacking.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG1.2",
        "Level":  "Level 4",
        "Description":  "A comprehensive process exists to identify and address unauthorized assets weekly. The organization documents their efforts, removes or quarantines assets, and regularly monitors and reports on their remediation activities.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.3",
        "Level":  "Level 1",
        "Description":  "No externally-exposed applications enforce multi-factor authentication (MFA).",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.3",
        "Level":  "Level 2",
        "Description":  "Some externally-exposed applications enforce MFA, but not all. Those that do are either not well-implemented or only implemented for specific users.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.3",
        "Level":  "Level 3",
        "Description":  "External applications have been identified as exposed and some of them require MFA. However, coverage is limited to a small number of applications.  External email access does require MFA.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.3",
        "Level":  "Level 4",
        "Description":  "All externally-exposed applications enforce MFA using an authenticated directory service or Single Sign-On (SSO) provider.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.5",
        "Level":  "Level 1",
        "Description":  "No MFA is enforced for administrative access accounts across enterprise assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.5",
        "Level":  "Level 2",
        "Description":  "Some administrative access accounts require MFA, but only on specific assets or for certain administrators.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.5",
        "Level":  "Level 3",
        "Description":  "Administrative access accounts have some level of MFA enforcement, but not all accounts are protected. There may be a lack of consistency in implementing MFA across different types of assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.5",
        "Level":  "Level 4",
        "Description":  "MFA is enforced for all administrative access accounts on all enterprise assets, whether managed on-site or through a service provider.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.2",
        "Level":  "Level 1",
        "Description":  "Audit logging is not enabled across any enterprise assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.2",
        "Level":  "Level 2",
        "Description":  "Some enterprise assets collect audit logs, but others do not. There may be a lack of consistency in implementing audit logging across different types of assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.2",
        "Level":  "Level 3",
        "Description":  "Audit logging has been enabled for certain asset types or systems, but not all assets are covered.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.2",
        "Level":  "Level 4",
        "Description":  "Audit logging is enabled and consistently implemented across all enterprise assets, including servers, workstations, network devices, and cloud services.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.2",
        "Level":  "Level 1",
        "Description":  "No automated backups are performed on any enterprise assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.2",
        "Level":  "Level 2",
        "Description":  "Some enterprise assets receive automated backups, but they occur less frequently than weekly.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.2",
        "Level":  "Level 3",
        "Description":  "Automated backups are enabled for certain asset types or systems, but not all assets are backed up. Backups may also be inconsistent in frequency or scope.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.2",
        "Level":  "Level 4",
        "Description":  "Automated backups are performed daily or more frequently on all enterprise assets, including sensitive data.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.3",
        "Level":  "Level 1",
        "Description":  "Recovery data is not protected with equivalent controls, and may be stored or transmitted unencrypted.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.3",
        "Level":  "Level 2",
        "Description":  "Some recovery data is protected using basic encryption methods, but this protection is not consistently applied or enforced.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.3",
        "Level":  "Level 3",
        "Description":  "Recovery data for certain systems or applications is protected, but sensitive data may be stored without equivalent controls. Data separation and encryption are used inconsistently.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.3",
        "Level":  "Level 4",
        "Description":  "All recovery data is protected using equivalent controls to the original data, including robust encryption methods, data separation, and consistent application of these controls across all systems and applications.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.4",
        "Level":  "Level 1",
        "Description":  "Recovery data is stored in a shared location, such as a network file share or database, without any isolation controls. Or, no recovery data is not maintained.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.4",
        "Level":  "Level 2",
        "Description":  "Some recovery data is stored on an isolated system or cloud service, but this is not consistently implemented or maintained. Backup destinations may be version-controlled, but not all systems are covered.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.4",
        "Level":  "Level 3",
        "Description":  "Recovery data for certain systems or applications is separated from production data using a separate storage device or offline backup destination. However, there may still be access controls in place that allow unauthorized personnel to read recovery data.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.4",
        "Level":  "Level 4",
        "Description":  "An isolated instance of recovery data is established and maintained, including version control through offline systems, cloud services, or off-site repositories. All systems and applications use consistent backup procedures and storage locations to maintain complete separation from production data.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.1",
        "Level":  "Level 1",
        "Description":  "A security awareness program does not exist, with no training provided to employees on secure practices.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.1",
        "Level":  "Level 2",
        "Description":  "New employees receive some basic security awareness training at hire, but annual training is not required or consistently administered. The content may be outdated or inadequate.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.1",
        "Level":  "Level 3",
        "Description":  "An annual review and update of the security awareness program content occurs, but significant enterprise changes are not promptly addressed in training updates. Training may be inconsistent or insufficient.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.1",
        "Level":  "Level 4",
        "Description":  "A comprehensive security awareness program is established and maintained, including annual training for all employees at hire, with updated content that addresses significant enterprise changes. The program is consistently administered and reviewed to ensure its effectiveness in educating employees on secure practices.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.2",
        "Level":  "Level 1",
        "Description":  "No training is provided to employees on recognizing social engineering attacks, making them vulnerable to phishing, BEC, pretexting, and other tactics.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.2",
        "Level":  "Level 2",
        "Description":  "Employees receive some basic awareness training on social engineering risks, but it is not comprehensive or regularly updated. The training may focus only on phishing, with little emphasis on other types of attacks.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.2",
        "Level":  "Level 3",
        "Description":  "Training is provided to employees on recognizing social engineering attacks on an occasional basis, but it is not a regular part of their job requirements. The training content may be outdated or inadequate for new threats.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.2",
        "Level":  "Level 4",
        "Description":  "Regular training sessions are held for all employees on recognizing social engineering attacks, including phishing, BEC, pretexting, and tailgating. The training content is updated regularly to address emerging threats, and it is an integral part of their job requirements to remain vigilant against these tactics.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.3",
        "Level":  "Level 1",
        "Description":  "No training is provided to employees on authentication best practices, leaving them vulnerable to weak passwords and inadequate authentication methods.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.3",
        "Level":  "Level 2",
        "Description":  "Employees receive some basic awareness training on password composition and credential management, but it does not cover more advanced topics such as multi-factor authentication. The training may be outdated or incomplete.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.3",
        "Level":  "Level 3",
        "Description":  "Training is provided to employees on authentication best practices on an occasional basis, focusing on general security principles rather than specific details about MFA and credential management. The training does not address the nuances of each practice.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.3",
        "Level":  "Level 4",
        "Description":  "Regular training sessions are held for all employees on authentication best practices, covering topics such as password composition, multi-factor authentication, and secure credential management. The training is comprehensive, up-to-date, and includes interactive exercises to reinforce learning.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG17.2",
        "Level":  "Level 1",
        "Description":  "No contact information exists for reporting security incidents to relevant parties, including internal staff, service providers, law enforcement, or government agencies.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG17.2",
        "Level":  "Level 2",
        "Description":  "Some contact information is established for reporting security incidents, but it is incomplete, outdated, or not thoroughly verified. Critical stakeholders may be missing from the list.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG17.2",
        "Level":  "Level 3",
        "Description":  "Contact information is updated periodically, but only basic changes are made. Verification of contacts is infrequent, and critical details about each contact may be lacking.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG17.2",
        "Level":  "Level 4",
        "Description":  "Comprehensive contact information exists for all relevant parties to report security incidents. Contact data is regularly verified annually to ensure accuracy, completeness, and up-to-date information.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.3",
        "Level":  "Level 1",
        "Description":  "The organization has no process in place to address unauthorized software usage, leaving it vulnerable to potential threats.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.3",
        "Level":  "Level 2",
        "Description":  "Unauthorized software is removed from use on enterprise assets, but there are no documented exceptions for its removal.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.3",
        "Level":  "Level 3",
        "Description":  "Unauthorized software is removed from use or receives a documented exception for continued access. However, this process lacks regular review and verification.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.3",
        "Level":  "Level 4",
        "Description":  "Regular monthly reviews (or more frequently) ensure unauthorized software is either removed from use or has a documented exception, with verification of compliance in place to prevent exceptions.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.2",
        "Level":  "Level 1",
        "Description":  "The organization does not have a data inventory or a process in place to establish and maintain one. Sensitive data is not identified or tracked.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.2",
        "Level":  "Level 2",
        "Description":  "A basic data inventory exists, but only includes general information about enterprise data. No priority is given to sensitive data, which is not identified or tracked.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.2",
        "Level":  "Level 3",
        "Description":  "An annual review of the data inventory is conducted, but no specific procedures are in place to update or prioritize sensitive data. The inventory remains incomplete.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.2",
        "Level":  "Level 4",
        "Description":  "A comprehensive data inventory is established and maintained, including all sensitive data. The inventory is reviewed and updated annually, with priority given to sensitive data identification and tracking. All details of the control are met.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.3",
        "Level":  "Level 1",
        "Description":  "No automatic session locking process exists on enterprise assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.3",
        "Level":  "Level 2",
        "Description":  "Automatic session locking is configured on some enterprise assets, but the period varies and does not meet specified requirements (15 minutes for general purpose OS, 2 minutes for mobile devices).",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.3",
        "Level":  "Level 3",
        "Description":  "Automatic session locking is configured on all enterprise assets, with the period set to either 15 minutes or less for general purpose operating systems and 2 minutes or less for mobile end-user devices.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.3",
        "Level":  "Level 4",
        "Description":  "Automatic session locking is configured on all enterprise assets, with periods of 15 minutes or less for general purpose operating systems and 2 minutes or less for mobile end-user devices. The policy is strictly enforced and audited regularly to ensure ongoing compliance.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.4",
        "Level":  "Level 1",
        "Description":  "No firewall is implemented or managed on servers, leaving them vulnerable to unauthorized access and malicious activity.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.4",
        "Level":  "Level 2",
        "Description":  "A basic firewall configuration is in place, but not properly monitored or updated, allowing potential security threats to go undetected.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.4",
        "Level":  "Level 3",
        "Description":  "A comprehensive firewall is implemented and managed, including regular updates and monitoring, but with some gaps in rules or configurations that require attention.  Inbound connections are disallowed by default.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.4",
        "Level":  "Level 4",
        "Description":  "All details of the firewall are properly documented, monitored, and updated in accordance with organizational policies and procedures, ensuring optimal security for servers.  Inbound connections are disallowed by default.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.5",
        "Level":  "Level 1",
        "Description":  "No host-based firewall or port-filtering tool is implemented on end-user devices, nor is there a default-deny rule in place.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.5",
        "Level":  "Level 2",
        "Description":  "A basic firewall is installed and configured on all end-user devices, but it does not have explicit rules to block unauthorized traffic. Default-allow settings are used for most services.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.5",
        "Level":  "Level 3",
        "Description":  "Explicit allow and deny rules are implemented on host-based firewalls or port-filtering tools, with a default-deny rule in place that drops all traffic except those services and ports explicitly allowed.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.5",
        "Level":  "Level 4",
        "Description":  "All end-user devices have fully configured host-based firewalls or port-filtering tools with explicit allow and deny rules, default-deny settings, and regular software updates to ensure maximum security.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.6",
        "Level":  "Level 1",
        "Description":  "No process exists to manage enterprise assets and software securely. All configurations and access are managed through insecure means, such as Telnet and HTTP.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.6",
        "Level":  "Level 2",
        "Description":  "Some assets and software are managed using secure methods, but not all. Configuration management is attempted through IaC, but administrative interfaces are accessed over unencrypted protocols like HTTP.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.6",
        "Level":  "Level 3",
        "Description":  "Most enterprise assets and software are managed securely, with configuration control achieved through IaC and access restricted to HTTPS and SSH. However, some exceptions exist for operationally critical systems that require Telnet or HTTP access.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.6",
        "Level":  "Level 4",
        "Description":  "All enterprise assets and software are securely managed, including all configurations controlled through version-controlled IaC and administrative interfaces accessed only over secure protocols like HTTPS and SSH. No exceptions are allowed for operational purposes.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.7",
        "Level":  "Level 1",
        "Description":  "No management process exists to manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.7",
        "Level":  "Level 2",
        "Description":  "A basic level of management is in place, but default accounts are not disabled or made unusable. Some controls may be implemented, but others remain unmanaged.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.7",
        "Level":  "Level 3",
        "Description":  "Default accounts on enterprise assets and software are managed through a documented process, including disabling or making them unusable. Regular reviews and updates ensure continued compliance.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.7",
        "Level":  "Level 4",
        "Description":  "All default accounts on enterprise assets and software are thoroughly managed, with detailed documentation of the control process. Procedural checks and automated tools enforce continuous management, ensuring all controls remain effective.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.3",
        "Level":  "Level 1",
        "Description":  "No process exists to disable dormant accounts, and there is no plan to implement one.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.3",
        "Level":  "Level 2",
        "Description":  "A manual review process is in place to identify and disable dormant accounts every 60 days, but this process may be inconsistent or incomplete.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.3",
        "Level":  "Level 3",
        "Description":  "An automated system is used to monitor account activity and enable a workflow for disabling dormant accounts after 45 days of inactivity, but there are some manual steps involved.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.3",
        "Level":  "Level 4",
        "Description":  "A fully automated system is in place to identify and disable dormant accounts within 24 hours of exceeding 45 days of inactivity, with regular reviews to ensure accuracy and efficiency.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.4",
        "Level":  "Level 1",
        "Description":  "No process exists to restrict administrator privileges or enforce dedicated administrator accounts.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.4",
        "Level":  "Level 2",
        "Description":  "Some enterprise assets have restricted administrator privileges, but not all, and user primary accounts still grant access to general computing activities.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.4",
        "Level":  "Level 3",
        "Description":  "Most enterprise assets have restricted administrator privileges, but some exceptions exist. User primary accounts are occasionally used for non-privileged activities, such as email or internet browsing.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.4",
        "Level":  "Level 4",
        "Description":  "All enterprise assets have strictly enforced dedicated administrator accounts, and user primary accounts only grant access to approved activities, ensuring all general computing activities are conducted from a non-privileged account.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.1",
        "Level":  "Level 1",
        "Description":  "The organization does not deploy or maintain anti-malware software on any of its enterprise assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.1",
        "Level":  "Level 2",
        "Description":  "Anti-malware software is deployed on some enterprise assets, but updates and maintenance are not regularly performed. Critical systems may not be fully protected.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.1",
        "Level":  "Level 3",
        "Description":  "Anti-malware software is deployed and maintained on all enterprise assets, with regular updates and scans performed to ensure protection against known threats.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.1",
        "Level":  "Level 4",
        "Description":  "Anti-malware software is deployed and maintained on all enterprise assets, with real-time protection, automatic updates, and advanced threat detection capabilities, ensuring comprehensive protection against all types of malware.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.2",
        "Level":  "Level 1",
        "Description":  "There is no established process in place to configure automatic anti-malware signature updates for enterprise assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.2",
        "Level":  "Level 2",
        "Description":  "Manual updates are performed for a subset of enterprise assets, with some assets not receiving regular updates.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.2",
        "Level":  "Level 3",
        "Description":  "Automatic updates are enabled on all enterprise assets, but the update schedule is incomplete or inconsistent across different asset types.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.2",
        "Level":  "Level 4",
        "Description":  "Automatic anti-malware signature updates are configured and executed daily/weekly for all enterprise assets, with consistent scheduling and monitoring to ensure accuracy.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.3",
        "Level":  "Level 1",
        "Description":  "No process exists to disable autorun and autoplay for removable media, increasing the risk of unauthorized software execution.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.3",
        "Level":  "Level 2",
        "Description":  "Disable autorun for removable media, but not autoplay, allowing malicious programs to potentially execute without user intervention.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.3",
        "Level":  "Level 3",
        "Description":  "Disable both autorun and autoplay functionality, but with exceptions for specific types of removable media or users, leaving room for potential exploitation.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.3",
        "Level":  "Level 4",
        "Description":  "Disable both autorun and autoplay auto-execute functionality for all types of removable media, ensuring that no unauthorized software can execute without user intervention.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.1",
        "Level":  "Level 1",
        "Description":  "No process exists for keeping the network infrastructure up-to-date.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.1",
        "Level":  "Level 2",
        "Description":  "The IT team reviews software versions monthly, but does not take any action to update the network if changes are necessary.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.1",
        "Level":  "Level 3",
        "Description":  "The IT team ensures that all network infrastructure is using a stable release of software and/or supported NaaS offerings. Software updates are reviewed and applied as needed.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.1",
        "Level":  "Level 4",
        "Description":  "All network infrastructure uses the latest stable release of software and/or supported NaaS offerings, and software versions are reviewed and updated at least monthly to ensure ongoing support.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.4",
        "Level":  "Level 1",
        "Description":  "No training program exists or is enforced for workforce members on data handling best practices. This increases risk to sensitive data.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.4",
        "Level":  "Level 2",
        "Description":  "A basic training program exists, but it lacks depth and clarity on specific details such as secure storage and destruction of data. Workforce members are not adequately equipped to handle sensitive information.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.4",
        "Level":  "Level 3",
        "Description":  "Workforce members receive regular training on data handling best practices, including clear screen and desk procedures. The training includes topics such as screen locking and physical asset security. However, some employees may not fully understand or apply these best practices.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.4",
        "Level":  "Level 4",
        "Description":  "A comprehensive training program is in place for all workforce members, covering all aspects of sensitive data handling, including secure storage, transfer, archiving, destruction, and clear screen and desk procedures. All employees demonstrate a thorough understanding and application of these best practices to protect sensitive information.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.5",
        "Level":  "Level 1",
        "Description":  "No formal training program exists for workforce members regarding the causes of unintentional data exposure.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.5",
        "Level":  "Level 2",
        "Description":  "A brief, one-time workshop is conducted on common causes of data exposure, such as mis-delivery and portable device loss.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.5",
        "Level":  "Level 3",
        "Description":  "Workforce members receive regular, in-depth training sessions on data exposure prevention, including best practices for handling sensitive information, secure communication protocols, and incident response procedures.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.5",
        "Level":  "Level 4",
        "Description":  "All workforce members participate in ongoing training sessions and are required to demonstrate knowledge of data exposure causes through regular quizzes or assessments. Instructors also monitor and enforce adherence to established policies and procedures.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.6",
        "Level":  "Level 1",
        "Description":  "There is no formal training program in place to educate workforce members on recognizing and reporting security incidents. No incident reporting system or process exists.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.6",
        "Level":  "Level 2",
        "Description":  "Workforce members receive basic training on what constitutes a security incident, including types of incidents (e.g., unauthorized access) and how to report them. However, no specific procedures are outlined for handling reported incidents.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.6",
        "Level":  "Level 3",
        "Description":  "A standardized incident reporting process is established, requiring workforce members to report incidents through a designated channel (e.g., email). Basic training on the process is provided, but incident response procedures are not detailed.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG14.6",
        "Level":  "Level 4",
        "Description":  "All workforce members participate in comprehensive security awareness training, including recognition of potential incidents and procedures for reporting them. Incident response procedures are clearly outlined, documented, and communicated to ensure timely and effective handling of reported incidents.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.2",
        "Level":  "Level 1",
        "Description":  "No process exists for ensuring authorized software is currently supported on enterprise assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.2",
        "Level":  "Level 2",
        "Description":  "A manual review of the software inventory occurs quarterly, but exceptions for unsupported software are not documented or approved.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.2",
        "Level":  "Level 3",
        "Description":  "Currently supported software is designated as authorized in the software inventory, and exceptions for unsupported software are documented with mitigating controls. However, documentation may be incomplete or outdated.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.2",
        "Level":  "Level 4",
        "Description":  "Regular reviews (monthly or more frequently) ensure that all enterprise assets have only currently supported software designated as authorized, and exceptions are thoroughly documented, approved, and monitored to verify residual risk acceptance.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.3",
        "Level":  "Level 1",
        "Description":  "No data access control lists are configured, allowing unrestricted access to sensitive data and systems.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.3",
        "Level":  "Level 2",
        "Description":  "Basic data access control lists are implemented, but only for a limited set of users and applications, leaving most systems and data unsecured.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.3",
        "Level":  "Level 3",
        "Description":  "Data access control lists are applied to local and remote file systems, databases, and applications, but not all necessary permissions are configured, creating security gaps.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.3",
        "Level":  "Level 4",
        "Description":  "Comprehensive data access control lists are implemented for all users, systems, and applications, ensuring that only authorized personnel have access to sensitive information, and all necessary permissions are properly configured.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.4",
        "Level":  "Level 1",
        "Description":  "No documented data management process exists, or data is retained without defined timelines.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.4",
        "Level":  "Level 2",
        "Description":  "A basic data retention policy is in place, but minimum and maximum timelines are not clearly established or communicated.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.4",
        "Level":  "Level 3",
        "Description":  "A standardized data retention policy with clear minimum and maximum timelines is documented and enforced, but exceptions may still occur without formal approval.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.4",
        "Level":  "Level 4",
        "Description":  "All data is retained according to the enterprise\u0027s documented data management process, including explicit guidelines for exceptions, and a transparent audit trail ensures compliance.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.5",
        "Level":  "Level 1",
        "Description":  "There is no documented data management process to guide the secure disposal of data.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.5",
        "Level":  "Level 2",
        "Description":  "A basic data disposal process exists, but it does not specify the method or sensitivity of the data being disposed of.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.5",
        "Level":  "Level 3",
        "Description":  "The organization\u0027s data disposal process complies with some aspects of the documented process, such as securely deleting sensitive information. However, other details are lacking or unclear.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.5",
        "Level":  "Level 4",
        "Description":  "All details in this control are met, including the secure disposal method and sensitivity guidelines, ensuring that all data is disposed of according to enterprise-approved procedures.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.6",
        "Level":  "Level 1",
        "Description":  "No encryption process is in place to protect sensitive data on end-user devices, leaving the organization vulnerable to unauthorized access.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.6",
        "Level":  "Level 2",
        "Description":  "Some encryption methods are used, such as Windows BitLocker or Apple FileVault, but not all endpoints are protected, creating a partial gap in security.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.6",
        "Level":  "Level 3",
        "Description":  "All end-user devices containing sensitive data are encrypted using a recognized method like Linux dm-crypt, ensuring that all data is adequately protected against unauthorized access.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.6",
        "Level":  "Level 4",
        "Description":  "Every endpoint device with sensitive data is encrypted using the most current and effective encryption methods, including regular key rotations and updates, to ensure maximum protection of sensitive information.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.4",
        "Level":  "Level 1",
        "Description":  "No requirement to implement multi-factor authentication (MFA) for remote network access is in place, leaving the organization vulnerable to unauthorized access.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.4",
        "Level":  "Level 2",
        "Description":  "MFA is required for some users or devices accessing the remote network, but not all. This partial implementation leaves a significant vulnerability in the overall security posture.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.4",
        "Level":  "Level 3",
        "Description":  "MFA is mandatory for all remote users and devices accessing the network, with some exceptions (e.g., authorized personnel only). While progress has been made, there are still potential weaknesses in the implementation.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.4",
        "Level":  "Level 4",
        "Description":  "All users and devices accessing the remote network are required to use MFA, with strict enforcement of the requirement. Every aspect of the implementation meets or exceeds industry best practices, ensuring maximum security and protection of sensitive data.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.3",
        "Level":  "Level 1",
        "Description":  "No automated operating system patch management is performed on any systems.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.3",
        "Level":  "Level 2",
        "Description":  "Patch management is performed manually and sporadically (e.g., quarterly).",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.3",
        "Level":  "Level 3",
        "Description":  null,
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.3",
        "Level":  "Level 4",
        "Description":  null,
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SGSystem administrators apply patches as needed",
        "Level":  "Level 1",
        "Description":  null,
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SGSystem administrators apply patches as needed",
        "Level":  "Level 2",
        "Description":  null,
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SGSystem administrators apply patches as needed",
        "Level":  "Level 3",
        "Description":  null,
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SGSystem administrators apply patches as needed",
        "Level":  "Level 4",
        "Description":  null,
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SGAll patches",
        "Level":  "Level 1",
        "Description":  "Level 1: Initial",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SGAll patches",
        "Level":  "Level 2",
        "Description":  "Level 2: Partial",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SGAll patches",
        "Level":  "Level 3",
        "Description":  "Level 3: Majority",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SGAll patches",
        "Level":  "Level 4",
        "Description":  "Level 4: Complete",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.7",
        "Level":  "Level 1",
        "Description":  "No data classification scheme exists. There is no standard method for classifying sensitive information, making it difficult to ensure confidentiality and integrity.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.7",
        "Level":  "Level 2",
        "Description":  "A basic data classification scheme has been established using labels such as \"Sensitive\" and \"Confidential.\" However, the scheme is not reviewed or updated regularly, leading to potential inconsistencies in classification.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.7",
        "Level":  "Level 3",
        "Description":  "An organized data classification scheme has been implemented, with clear labels and guidelines for classifying sensitive information. The scheme is reviewed annually, but changes are not always reflected promptly, potentially introducing gaps in protection.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.7",
        "Level":  "Level 4",
        "Description":  "A comprehensive and regularly updated data classification scheme exists, with clear guidelines, labels, and procedures for ensuring confidentiality and integrity. The scheme is continuously reviewed and updated to reflect changing business needs and enterprise requirements.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.8",
        "Level":  "Level 1",
        "Description":  "No data flow documentation exists, and no effort is made to document service provider data flows.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.8",
        "Level":  "Level 2",
        "Description":  "Basic data flow documentation is provided, but it is not based on the enterprise\u0027s data management process and does not include all necessary information.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.8",
        "Level":  "Level 3",
        "Description":  "Data flow documentation is maintained annually, or when significant enterprise changes occur. It includes service provider data flows, but may lack specific details about data processing.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.8",
        "Level":  "Level 4",
        "Description":  "Comprehensive data flow documentation is provided and based on the enterprise\u0027s data management process. Review and update documentation annually, with detailed information about service provider data flows and all necessary processes.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.9",
        "Level":  "Level 1",
        "Description":  "No encryption process exists for data on removable media, leaving sensitive information vulnerable to unauthorized access.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.9",
        "Level":  "Level 2",
        "Description":  "Data on removable media is encrypted with a weak password and outdated encryption software, providing minimal protection against unauthorized access.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.9",
        "Level":  "Level 3",
        "Description":  "Data on removable media is encrypted with industry-standard encryption software using strong passwords and up-to-date key management practices, providing adequate protection for sensitive information.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.9",
        "Level":  "Level 4",
        "Description":  "Data on removable media is fully encrypted with the latest encryption technologies, including secure key exchange and revocation processes, ensuring maximum protection against unauthorized access and data breaches.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.10",
        "Level":  "Level 1",
        "Description":  "No encryption process exists to protect sensitive data in transit.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.10",
        "Level":  "Level 2",
        "Description":  "Transport Layer Security (TLS) is used to encrypt some sensitive web-ased data in transit, while SSH is not in use.  This results in other sensitive data not being encrypted, leaving gaps in protection.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.10",
        "Level":  "Level 3",
        "Description":  "Secure Shell (SSH) and TLS are implemented to encrypt certain types of sensitive data, and some encryption protocols are used for sensitive data transmission. However, full implementation of encryption requirements remains incomplete.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.10",
        "Level":  "Level 4",
        "Description":  "All sensitive data is encrypted in transit using both TLS and SSH, as applicable, meeting all encryption requirements and providing comprehensive protection against interception and eavesdropping.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.8",
        "Level":  "Level 1",
        "Description":  "No process exists to uninstall or disable unnecessary services on enterprise assets and software.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.8",
        "Level":  "Level 2",
        "Description":  "Some unnecessary services have been identified on enterprise assets and software, but there is no centralized process in place to review and approve service removals.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.8",
        "Level":  "Level 3",
        "Description":  "Most unnecessary services are disabled or uninstalled on enterprise assets and software, but the process could be improved for consistency and accuracy.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.8",
        "Level":  "Level 4",
        "Description":  "All unnecessary services are disabled or uninstalled on all enterprise assets and software, and a centralized process exists to review and approve service removals.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.9",
        "Level":  "Level 1",
        "Description":  "No configuration or setup exists for trusted DNS servers on network infrastructure, leaving assets vulnerable to DNS spoofing attacks.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.9",
        "Level":  "Level 2",
        "Description":  "Some network devices have been configured to use a single enterprise-controlled DNS server, but other critical infrastructure may still rely on untrusted DNS sources, leaving security gaps.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.9",
        "Level":  "Level 3",
        "Description":  "All network devices are configured to use enterprise-controlled DNS servers and/or reputable externally accessible DNS servers, reducing the risk of DNS spoofing attacks. However, there is no centralized monitoring or audit control in place.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.9",
        "Level":  "Level 4",
        "Description":  "A comprehensive DNS management policy has been implemented, including centralized monitoring and audit controls for all network devices using trusted DNS servers. Regular security assessments and penetration testing are performed to ensure continuous compliance with organizational policies.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.5",
        "Level":  "Level 1",
        "Description":  "No inventory of service accounts exists.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.5",
        "Level":  "Level 2",
        "Description":  "An empty spreadsheet with the required fields (department owner, review date, and purpose) is created, but no reviews have been performed.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.5",
        "Level":  "Level 3",
        "Description":  "A minimal inventory system is implemented, with periodic reviews conducted at least quarterly. However, the inventory only includes a subset of service accounts.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.5",
        "Level":  "Level 4",
        "Description":  "An accurate and up-to-date inventory of all active service accounts is maintained, with regular reviews performed on a recurring schedule of at least quarterly to ensure authorized access continues.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.6",
        "Level":  "Level 1",
        "Description":  "No centralized account management process exists, and user accounts are created and managed individually by each system administrator.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.6",
        "Level":  "Level 2",
        "Description":  "A basic directory is established using a password file or text file to store user credentials, but no identity service is used.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.6",
        "Level":  "Level 3",
        "Description":  "A simple directory service, such as a LDAP server, is set up to manage user accounts. However, access controls and auditing are not enforced.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG5.6",
        "Level":  "Level 4",
        "Description":  "A robust identity management system, including a centralized directory (e.g., Active Directory), password storage using encryption, and strict access controls and auditing, is in place to ensure secure user account management.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.6",
        "Level":  "Level 1",
        "Description":  "No inventory exists or is maintained by the organization, which leaves authentication and authorization systems vulnerable to unauthorized access.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.6",
        "Level":  "Level 2",
        "Description":  "An initial inventory of authentication and authorization systems has been created, but it is incomplete or outdated, leaving some systems unaccounted for or with incorrect information.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.6",
        "Level":  "Level 3",
        "Description":  "A comprehensive inventory of authentication and authorization systems exists, including both on-site and remote systems, but the review and update process is not conducted as frequently as required (e.g., less than annually).",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.6",
        "Level":  "Level 4",
        "Description":  "An up-to-date and accurate inventory of all authentication and authorization systems is maintained and reviewed at least annually or more frequently, ensuring that all systems are properly accounted for and secure.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.6",
        "Level":  "Level 1",
        "Description":  "No process exists for performing automated vulnerability scans of externally-exposed enterprise assets. This control is not implemented.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.6",
        "Level":  "Level 2",
        "Description":  "Manual vulnerability scans are performed on a quarterly basis, but scanning frequency varies across assets and departments. Automated scanning tools are available but not utilized.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.6",
        "Level":  "Level 3",
        "Description":  "Automated vulnerability scans are performed monthly on high-risk assets using pre-configured scanning tools. Scans are limited to publicly accessible ports and services.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.6",
        "Level":  "Level 4",
        "Description":  "All externally-exposed enterprise assets undergo automated vulnerability scans at least monthly, using configured scanning tools with real-time updates and alerts for remediation. Scan results are reviewed and addressed promptly by authorized personnel.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.7",
        "Level":  "Level 1",
        "Description":  "Remediate detected vulnerabilities in software through processes and tooling on a monthly, or more frequent, basis, based on the remediation process.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.7",
        "Level":  "Level 2",
        "Description":  "Vulnerabilities are monitored monthly using automated tools, but remediation is not performed, leaving known vulnerabilities unaddressed and potential security gaps remaining.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.7",
        "Level":  "Level 3",
        "Description":  "A basic remediation process exists, with vulnerability scanning performed on a regular basis. However, the process may be incomplete or inefficient, leading to ongoing exposure to unremediated vulnerabilities.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.7",
        "Level":  "Level 4",
        "Description":  "A comprehensive remediation process is in place, with detected vulnerabilities remediated promptly using established procedures. Regular reporting ensures transparency into vulnerability management and helps identify areas for continuous improvement.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.5",
        "Level":  "Level 1",
        "Description":  "No DMARC, SPF or DKIM implementation exists.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.5",
        "Level":  "Level 2",
        "Description":  "SPF, DKIM and DMARC standards are not all implemented, or the DMARC policy is set to \"none\" and SPF may not include all sending servers.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.5",
        "Level":  "Level 3",
        "Description":  "SPF, DKIM and DMARC standards are implemented, but the DMARC policy is set to \"quarantine\" with a percentage of p\u003c50, allowing some illegitimate emails to make it into the inbox.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.5",
        "Level":  "Level 4",
        "Description":  "Comprehensive SPF, DKIM and DMARC standards implementation is in place, with the DMARC policy set to \"reject\" with a percentage p=100, ensuring robust protection against spoofed or modified emails.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.6",
        "Level":  "Level 1",
        "Description":  "The organization does not have a process in place to block unnecessary file types from entering its email gateway.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.6",
        "Level":  "Level 2",
        "Description":  "The organization has a basic rule in place to block certain known malicious file types, but it is not up-to-date and lacks comprehensive coverage.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.6",
        "Level":  "Level 3",
        "Description":  "The organization has implemented a more robust filtering system that blocks a wide range of unnecessary file types, including malware and virus-ridden files. However, it may still allow some exceptions for illegitimate files.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.6",
        "Level":  "Level 4",
        "Description":  "The organization has fully implemented a content inspection solution that blocks all unnecessary file types, including zero-day threats, and provides detailed logging and reporting capabilities to ensure maximum protection of its email gateway.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.4",
        "Level":  "Level 1",
        "Description":  "No documentation is maintained, nor is there any process in place to establish and maintain architecture diagrams.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.4",
        "Level":  "Level 2",
        "Description":  "Basic documentation exists, but it lacks detail, clarity, or is outdated, failing to accurately represent the enterprise\u0027s network system architecture.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.4",
        "Level":  "Level 3",
        "Description":  "Architecture diagrams exist, but they are incomplete, inconsistent, or not regularly reviewed. Significant updates occur sporadically, without a formal process in place.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.4",
        "Level":  "Level 4",
        "Description":  "Comprehensive, up-to-date, and accurate architecture diagrams are established and maintained annually, with all significant enterprise changes documented and incorporated into the system.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.2",
        "Level":  "Level 1",
        "Description":  "No policy exists to manage service providers, leaving the organization vulnerable to potential security risks.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.2",
        "Level":  "Level 2",
        "Description":  "A basic policy is established, but it lacks detail on classification, inventory management, and decommissioning procedures, potentially leading to inconsistent security practices.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.2",
        "Level":  "Level 3",
        "Description":  "A comprehensive policy is implemented that outlines specific requirements for classifying, assessing, monitoring, and decommissioning service providers. The policy is regularly reviewed and updated.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.2",
        "Level":  "Level 4",
        "Description":  "All details in the Service Provider Management Policy are met, including classification, inventory management, regular assessments, ongoing monitoring, and thorough decommissioning procedures. The policy is up-to-date and enforced consistently across all service providers.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.3",
        "Level":  "Level 1",
        "Description":  "No classification exists for service providers. No consideration is taken into account regarding data sensitivity, volume, availability requirements, or regulations. This lack of classification increases inherent risk.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.3",
        "Level":  "Level 2",
        "Description":  "Basic classification criteria are in place, including general characteristics such as data sensitivity and regulatory compliance. However, no specific provider assessments have been conducted to evaluate mitigated risks. Annual review is still necessary.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.3",
        "Level":  "Level 3",
        "Description":  "Enhanced classification criteria include detailed evaluations of service providers\u0027 inherent and mitigated risks. Providers are assessed against data volume, availability requirements, and applicable regulations. Regular reviews (quarterly) ensure ongoing evaluation and updates.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.3",
        "Level":  "Level 4",
        "Description":  "Comprehensive classification is fully implemented, with thorough assessments of all service provider characteristics. Evaluations include ongoing monitoring, risk analysis, and periodic reviews (monthly). All details are accurately documented and up-to-date, ensuring continuous adherence to this Safeguard.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.4",
        "Level":  "Level 1",
        "Description":  "No security requirements exist in service provider contracts, and no annual review process is in place.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.4",
        "Level":  "Level 2",
        "Description":  "Security requirements are included in some service provider contracts, but only basic requirements like encryption are present. Annual reviews occur, but issues may arise.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.4",
        "Level":  "Level 3",
        "Description":  "Most service provider contracts include security requirements that align with the enterprise\u0027s policy. Requirements are comprehensive and address incidents and data breaches. Regular annual reviews ensure all security requirements are met.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.4",
        "Level":  "Level 4",
        "Description":  "All necessary security requirements are consistently included in service provider contracts, and annual reviews confirm compliance. The enterprise\u0027s security management policy is clearly reflected in contracts, ensuring robust protection of sensitive information.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.1",
        "Level":  "Level 1",
        "Description":  "No secure application development process exists, resulting in inadequate protection against security vulnerabilities.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.1",
        "Level":  "Level 2",
        "Description":  "A basic process is established with minimal documentation and training, but it lacks comprehensive review and updates, leaving room for errors and weaknesses.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.1",
        "Level":  "Level 3",
        "Description":  "A structured approach to secure application development is implemented, including standard design principles and coding practices, but vulnerable third-party code is not properly reviewed or secured, and testing procedures are incomplete.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.1",
        "Level":  "Level 4",
        "Description":  "A robust, documented process is established, with regular reviews and updates, comprehensive developer training, thorough vulnerability management, and rigorous application security testing procedures in place to ensure the development of secure applications.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.2",
        "Level":  "Level 1",
        "Description":  null,
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.2",
        "Level":  "Level 2",
        "Description":  null,
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.2",
        "Level":  "Level 3",
        "Description":  null,
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.2",
        "Level":  "Level 4",
        "Description":  null,
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SGThird-party application developers need to consider this an externally-facing policy that helps to set expectations for outside stakeholders.\"",
        "Level":  "Level 1",
        "Description":  "Level 1: Initial",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SGThird-party application developers need to consider this an externally-facing policy that helps to set expectations for outside stakeholders.\"",
        "Level":  "Level 2",
        "Description":  "Level 2: Partial",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SGThird-party application developers need to consider this an externally-facing policy that helps to set expectations for outside stakeholders.\"",
        "Level":  "Level 3",
        "Description":  "Level 3: Majority",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SGThird-party application developers need to consider this an externally-facing policy that helps to set expectations for outside stakeholders.\"",
        "Level":  "Level 4",
        "Description":  "Level 4: Complete",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.5",
        "Level":  "Level 1",
        "Description":  "No technical controls in place, such as allowlisting, to restrict unauthorized software access. Authorized personnel still use unapproved applications.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.5",
        "Level":  "Level 2",
        "Description":  "Basic application allowlisting implemented, but only for a limited subset of approved applications. Insufficient to prevent most unauthorized software from accessing the system.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.5",
        "Level":  "Level 3",
        "Description":  "Comprehensive application allowlisting is in place, covering all authorized software. Regularly reviewed and updated every two years or more frequently.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.5",
        "Level":  "Level 4",
        "Description":  "All aspects of application allowlisting are met, including continuous monitoring and updates to ensure only authorized software executes or accesses the system, with no exceptions.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.11",
        "Level":  "Level 1",
        "Description":  "No encryption process exists for sensitive data at rest on servers, applications, and databases.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.11",
        "Level":  "Level 2",
        "Description":  "Storage-layer encryption is implemented, but no additional application-layer encryption is in place to protect sensitive data from unauthorized access.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.11",
        "Level":  "Level 3",
        "Description":  "Both storage-layer and application-layer encryption are implemented on most, but not all systems, providing comprehensive protection for sensitive data at rest on servers, applications, and databases.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.11",
        "Level":  "Level 4",
        "Description":  "All sensitive data at rest on all servers, applications, and databases is encrypted using both storage-layer and application-layer methods, ensuring maximum protection against unauthorized access.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.12",
        "Level":  "Level 1",
        "Description":  "No segregation of sensitive data from non-sensitive data is in place, and sensitive data is processed and stored without regard to its sensitivity.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.12",
        "Level":  "Level 2",
        "Description":  "Sensitive data is not fully segregated from non-sensitive data; some processing and storage occur on enterprise assets intended for lower sensitivity data. This may lead to potential security breaches.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.12",
        "Level":  "Level 3",
        "Description":  "Sensitive data is segmented from non-sensitive data, with separate processes and systems designed to handle each type of data. However, there may be instances where sensitive data is processed or stored alongside non-sensitive data without proper segregation controls.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.12",
        "Level":  "Level 4",
        "Description":  "All sensitive data is thoroughly segregated from non-sensitive data through multiple layers of controls, including physical separation, access control, and monitoring. No processing or storage occurs on enterprise assets intended for lower sensitivity data, ensuring maximum data protection.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.10",
        "Level":  "Level 1",
        "Description":  "There is no process in place to enforce automatic device lockout on portable end-user devices, and no threshold limits are established for authentication attempts.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.10",
        "Level":  "Level 2",
        "Description":  "A basic device management tool is used to implement device lockdown, but the threshold limit is not clearly defined or enforced. For example, a laptop may allow up to 30 failed authentication attempts.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.10",
        "Level":  "Level 3",
        "Description":  "Automatic device lockout is partially implemented, with specific thresholds for laptops and mobile devices (e.g., 20 failed attempts on laptops, 10 failed attempts on tablets and smartphones). However, the implementation may not be consistently enforced across all devices.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.10",
        "Level":  "Level 4",
        "Description":  "A comprehensive device management tool fully enforces automatic device lockout, with clear threshold limits established for each type of portable end-user device (e.g., 20 failed authentication attempts on laptops, 10 failed attempts on tablets and smartphones). Lockout is consistently and promptly enforced across all devices.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.7",
        "Level":  "Level 1",
        "Description":  "No centralized access control mechanism exists for the organization\u0027s enterprise assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.7",
        "Level":  "Level 2",
        "Description":  "A basic access control system is in place, but it is not centralized and does not use a directory service or SSO provider.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.7",
        "Level":  "Level 3",
        "Description":  "Centralized access control is implemented through a directory service or SSO provider for some, but not all, enterprise assets. Authentication and authorization processes are inconsistent across the organization.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.7",
        "Level":  "Level 4",
        "Description":  "A fully centralized access control system is in place, utilizing a robust directory service or SSO provider that manages authentication and authorization for all enterprise assets, ensuring consistent and secure access.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.5",
        "Level":  "Level 1",
        "Description":  "No process exists to perform automated vulnerability scans of internal enterprise assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.5",
        "Level":  "Level 2",
        "Description":  "A manual, quarterly review of high-risk assets is conducted by a designated security team. However, no automated scanning is performed, and the scope of the review is limited to a select number of assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.5",
        "Level":  "Level 3",
        "Description":  "Automated vulnerability scans are conducted on most but not all internal enterprise assets at least quarterly using industry-standard tools. Unauthenticated and authenticated scans are done less frequently than quarterly. The organization maintains a centralized reporting system for scan results.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG7.5",
        "Level":  "Level 4",
        "Description":  "All internal enterprise assets undergo both authenticated and unauthenticated automated vulnerability scans on a quarterly or more frequently basis using industry-standard tools. Scan results are reviewed and reported in real-time to the security team and management. A continuous monitoring program is also implemented to identify and remediate vulnerabilities promptly.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.4",
        "Level":  "Level 1",
        "Description":  "No standardized time synchronization process exists within the enterprise.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.4",
        "Level":  "Level 2",
        "Description":  "A single time source is configured, but it is not consistently used across all enterprise assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.4",
        "Level":  "Level 3",
        "Description":  "At least two synchronized time sources are configured and consistently used on certain enterprise assets. However, some assets do not utilize standardized time synchronization.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.4",
        "Level":  "Level 4",
        "Description":  "Standardized time synchronization is consistently applied to all enterprise assets, using at least two synchronized time sources that are regularly verified for accuracy.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.9",
        "Level":  "Level 1",
        "Description":  "No centralized audit log collection or retention process exists within the enterprise. Separate systems and assets lack documented audit logs, making it difficult to detect and respond to security incidents.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.9",
        "Level":  "Level 2",
        "Description":  "Some audit logs are centralized using a SIEM tool, but not all enterprise assets are connected. Logs from a few systems are collected, but others remain unmonitored, leaving gaps in visibility and incident response capabilities.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.9",
        "Level":  "Level 3",
        "Description":  "All enterprise assets have a centralized audit log collection process, but retention policies vary across teams and departments. Some logs are retained for an extended period, while others are deleted prematurely, leading to inconsistent security incident detection and response.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.9",
        "Level":  "Level 4",
        "Description":  "A comprehensive, documented audit log management process is in place, with centralized logging and retention across all enterprise assets. Logs are retained for a minimum of 90 days, and a SIEM tool is used to monitor and analyze logs from multiple systems, ensuring timely security incident detection and response.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.4",
        "Level":  "Level 1",
        "Description":  "Removable media is not scanned automatically.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.4",
        "Level":  "Level 2",
        "Description":  "Automatic anti-malware scanning of removable media is enabled, but only when a user explicitly selects it in the software.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.4",
        "Level":  "Level 3",
        "Description":  "Automatic anti-malware scanning of removable media is enabled for all users by default, but exceptions are allowed with explicit user consent.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.4",
        "Level":  "Level 4",
        "Description":  "Automated automatic anti-malware scanning of removable media is enabled, with no exceptions or manual intervention required to ensure protection against malware.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.5",
        "Level":  "Level 1",
        "Description":  "No anti-exploitation features are enabled on enterprise assets and software.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.5",
        "Level":  "Level 2",
        "Description":  "Some anti-exploitation features are enabled on select enterprise assets and software.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.5",
        "Level":  "Level 3",
        "Description":  "Anti-exploitation features are enabled on many, but not all, relevant enterprise assets and software.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.5",
        "Level":  "Level 4",
        "Description":  "All anti-exploitation features are enabled on every enterprise asset and software, ensuring maximum protection against exploitation.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.6",
        "Level":  "Level 1",
        "Description":  "Anti-malware software is not used in the enterprise, leaving it vulnerable to malware attacks.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.6",
        "Level":  "Level 2",
        "Description":  "No centralized management process exists for anti-malware software, and each user installs and maintains their own software.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.6",
        "Level":  "Level 3",
        "Description":  "Most users have a centralized management system, but there are known instances of exceptions or incomplete implementation (e.g., some systems are outdated or not properly updated). The manager is aware of these issues.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.6",
        "Level":  "Level 4",
        "Description":  "A fully functional and centrally managed anti-malware software system is in place for all users, with regular updates, monitoring, and reporting. Exceptions have been addressed and documented.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.7",
        "Level":  "Level 1",
        "Description":  "The organization does not use behavior-based anti-malware software, leaving it vulnerable to malware attacks.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.7",
        "Level":  "Level 2",
        "Description":  "Behavior-based anti-malware software is used, but its configuration and updates are not properly managed, resulting in incomplete protection against malware threats.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.7",
        "Level":  "Level 3",
        "Description":  "The organization uses behavior-based anti-malware software, but only on some systems, leaving critical systems unprotected. Software is also outdated or misconfigured, reducing its effectiveness.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG10.7",
        "Level":  "Level 4",
        "Description":  "Behavior-based anti-malware software is used and properly configured across all systems, with regular updates and monitoring to ensure comprehensive protection against malware threats, maintaining the security of sensitive data.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.5",
        "Level":  "Level 1",
        "Description":  "No backup and recovery testing process exists within the organization.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.5",
        "Level":  "Level 2",
        "Description":  "Backups are tested infrequently and a comprehensive sampling of in-scope assets is not performed.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.5",
        "Level":  "Level 3",
        "Description":  "A limited test of backups and recoveries is conducted quarterly, covering only a subset of in-scope assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG11.5",
        "Level":  "Level 4",
        "Description":  "Regular testing (at least quarterly) of backup and recovery processes is performed for a comprehensive sampling of all in-scope enterprise assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.2",
        "Level":  "Level 1",
        "Description":  "No control exists to establish and maintain a secure network architecture. The organization has no policies, procedures, or design documents in place to address segmentation, least privilege, and availability.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.2",
        "Level":  "Level 2",
        "Description":  "An internal and external firewall is present and a basic segmentation process is implemented, but does not meet all the requirements of the control. Segmenting the network into smaller sections may exist, but access controls are lacking, and availability may be compromised.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.2",
        "Level":  "Level 3",
        "Description":  "A comprehensive secure network architecture has been designed and maintained. Segmentation, least privilege, and availability have been addressed.  However, thorough documentation and adequate policy is lacking.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.2",
        "Level":  "Level 4",
        "Description":  "All details required by the control have been met. The organization\u0027s secure network architecture meets all requirements, including segmentation, least privilege, and availability and is supported with documentation, policy and design components.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.5",
        "Level":  "Level 1",
        "Description":  "No centralized network authentication, authorization, or auditing process exists, leaving systems vulnerable to unauthorized access and malicious activity.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.5",
        "Level":  "Level 2",
        "Description":  "A basic AAA framework is in place, with separate servers for authentication, authorization, and auditing. However, logging and monitoring capabilities are limited or not configured.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.5",
        "Level":  "Level 3",
        "Description":  "Centralized AAA services are fully implemented, with robust logging and auditing capabilities. Authentication, authorization, and accounting (AAA) protocols are enforced on all network devices.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.5",
        "Level":  "Level 4",
        "Description":  "Comprehensive centralized AAA infrastructure is in place, including advanced logging and monitoring features. All network devices enforce AAA policies, and incident response procedures are established for swift detection and response to security incidents.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.1",
        "Level":  "Level 1",
        "Description":  "The organization does not have a centralized system for alerting on security events, and logs are not correlated or analyzed.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.1",
        "Level":  "Level 2",
        "Description":  "A basic log aggregation tool is used to collect security-related logs, but there is no correlation or analysis of these logs. Vendor-defined event correlation alerts may be generated, but they are not configured.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.1",
        "Level":  "Level 3",
        "Description":  "A Security Information and Event Management (SIEM) system is in place, which correlates and analyzes security-relevant log data. The SIEM generates vendor-defined event correlation alerts and provides basic alerting capabilities.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.1",
        "Level":  "Level 4",
        "Description":  "The organization has implemented a comprehensive log analytics platform configured with advanced security-relevant correlation alerts. This platform provides real-time analysis of security events, correlated logs, and incident response capabilities to support effective threat detection and mitigation.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.4",
        "Level":  "Level 1",
        "Description":  "No inventory of third-party software components exists. No assessment of risks associated with each component has been performed.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.4",
        "Level":  "Level 2",
        "Description":  "An outdated inventory of third-party components is maintained, and no evaluation of risks or updates to the list occurs. The inventory lacks any information on supported versions and known vulnerabilities.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.4",
        "Level":  "Level 3",
        "Description":  "A basic inventory of third-party components is established, but no regular evaluations occur to identify changes or updates. Some risks are assessed, but not all components have risk assessments associated with them. Supported versions and known vulnerabilities are documented.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.4",
        "Level":  "Level 4",
        "Description":  "An up-to-date inventory of third-party components is maintained, regularly evaluated at least monthly to identify changes or updates. All components have risk assessments, supported versions, and known vulnerabilities documented. The list is validated to ensure the component is still supported and not at risk.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.5",
        "Level":  "Level 1",
        "Description":  "No process exists to ensure third-party software components are used in a secure manner. Untrusted and outdated components may be used, putting the organization at risk.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.5",
        "Level":  "Level 2",
        "Description":  "A basic review is performed to evaluate third-party software components for vulnerabilities before use. However, this review is not comprehensive, and unverified sources are often used. Risk mitigation measures are not consistently applied.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.5",
        "Level":  "Level 3",
        "Description":  "Third-party software components are evaluated for vulnerabilities using a standardized process. Components from trusted sources are chosen whenever possible. Some risk mitigation measures may be missing or inadequately implemented.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.5",
        "Level":  "Level 4",
        "Description":  "A thorough, comprehensive review is conducted to evaluate third-party software components for vulnerabilities before use. Only established and proven frameworks and libraries are used, sourced from trusted vendors. All risk mitigation measures are consistently applied and up-to-date, ensuring robust security controls.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.7",
        "Level":  "Level 1",
        "Description":  "No standard hardening configuration templates are used for application infrastructure components. In-house developed configurations or no configurations exist at all, leaving the infrastructure vulnerable to security threats.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.7",
        "Level":  "Level 2",
        "Description":  "Standard hardening configuration templates are not consistently used across all application infrastructure components. Some components have in-house developed configurations that may weaken security.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.7",
        "Level":  "Level 3",
        "Description":  "Industry-standard hardening configuration templates are used for most application infrastructure components, but some exceptions exist. In-house developed configurations are limited to specific components only, reducing the risk of security vulnerabilities.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.7",
        "Level":  "Level 4",
        "Description":  "All application infrastructure components adhere to standard, industry-recommended hardening configuration templates. No in-house developed software is allowed, ensuring a secure and consistent configuration for all cloud containers, PaaS components, SaaS components, and underlying servers, databases, and web servers.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.8",
        "Level":  "Level 1",
        "Description":  "No separation exists, production and non-production systems share the same environment with no barriers in place.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.8",
        "Level":  "Level 2",
        "Description":  "A physical or network barrier is present but not enforced, allowing unauthorized access between production and non-production systems.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.8",
        "Level":  "Level 3",
        "Description":  "Separate environments exist, but they are not strictly enforced or monitored, with potential for unauthorized access or tampering.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.8",
        "Level":  "Level 4",
        "Description":  "Strict separation and monitoring exists, with multiple barriers in place to prevent unauthorized access between production and non-production systems.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.9",
        "Level":  "Level 1",
        "Description":  "No formal training program is in place for software development personnel regarding application security concepts and secure coding practices. This lack of training increases the risk of insecure code being developed.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.9",
        "Level":  "Level 2",
        "Description":  "Developers receive general training on security principles, but this is sporadic and not mandatory. Security standard practices are not consistently applied to all development projects, leaving some teams at high risk of producing insecure code.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.9",
        "Level":  "Level 3",
        "Description":  "Annual training sessions are conducted for software development personnel on application security concepts and secure coding practices. However, the training program can be inconsistent in its delivery and effectiveness, leading to variability in developers\u0027 understanding of security best practices.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.9",
        "Level":  "Level 4",
        "Description":  "A comprehensive security training program is implemented, ensuring all software development personnel receive regular training on application security concepts and secure coding practices. The training program promotes a culture of security within the development team, resulting in consistent and high-quality application security standards across all projects.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.10",
        "Level":  "Level 1",
        "Description":  "No secure design principles are applied in application architectures. User input is not validated, and security measures are lacking.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.10",
        "Level":  "Level 2",
        "Description":  "Basic secure design principles are partially implemented, such as explicit error checking for some input types, but other controls like mediation and least privilege are missing.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.10",
        "Level":  "Level 3",
        "Description":  "Secure design principles are largely applied, including validation of most user input and enforcement of mediation. However, there may be gaps in the application infrastructure attack surface or inadequate documentation of security measures.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.10",
        "Level":  "Level 4",
        "Description":  "All secure design principles are fully implemented, including explicit error checking for all input types, mediation to validate every operation, least privilege access controls, and minimized application infrastructure attack surface. Security measures are thoroughly documented and enforced.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.11",
        "Level":  "Level 1",
        "Description":  "The organization does not use vetted modules or services for application security components, resulting in inadequate identity management, encryption, auditing, and logging.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.11",
        "Level":  "Level 2",
        "Description":  "The organization uses some vetted modules or services, but there is no standardized approach to deploying them across the application development lifecycle. This leaves vulnerabilities in place.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.11",
        "Level":  "Level 3",
        "Description":  "The organization uses vetted modules or services for certain security components, such as identity management and encryption, but has not implemented a consistent and standardized approach to their use across all applications.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.11",
        "Level":  "Level 4",
        "Description":  "The organization uses only vetted, standardized, and extensively reviewed modules or services for all application security components, including auditing and logging. This ensures consistency and effectiveness in protecting against security threats.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG18.2",
        "Level":  "Level 1",
        "Description":  "No periodic external penetration tests are performed, despite program requirements. No reconnaissance is conducted to detect exploitable information.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG18.2",
        "Level":  "Level 2",
        "Description":  "Annual external penetration tests are performed, but only on a limited scope and without enterprise and environmental reconnaissance. The testing may not be clear box or opaque box.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG18.2",
        "Level":  "Level 3",
        "Description":  "Two or three external penetration tests are performed annually using clear box testing methods. Enterprise and environmental reconnaissance is conducted to detect exploitable information, but the scope of testing is limited compared to required activities. A qualified party conducts the testing, but may not have specialized skills or experience.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG18.2",
        "Level":  "Level 4",
        "Description":  "More than four external penetration tests are performed annually using opaque box testing methods, covering all enterprise and environmental reconnaissance requirements. A fully qualified party with specialized skills and experience conducts the testing to ensure comprehensive coverage of potential vulnerabilities.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG18.3",
        "Level":  "Level 1",
        "Description":  "No documented vulnerability remediation process is in place, resulting in a lack of coordination and effort to address penetration test findings.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG18.3",
        "Level":  "Level 2",
        "Description":  "A basic remediation process exists, but it lacks detail or specific guidance on timelines and levels of effort. As a result, some findings are not addressed or require manual re-evaluation.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG18.3",
        "Level":  "Level 3",
        "Description":  "The documented vulnerability remediation process is comprehensive, with clear guidelines for addressing each type of finding. Findings,, however, are not prioritized or addressed within a reasonable timeline.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG18.3",
        "Level":  "Level 4",
        "Description":  "All penetration test findings are thoroughly assessed, prioritized, and remediated according to the documented process, resulting in prompt resolution of vulnerabilities and minimal risk to the enterprise\u0027s information assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG1.3",
        "Level":  "Level 1",
        "Description":  "The organization does not utilize any active discovery tools, nor do they have a process in place to identify connected assets on their network.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG1.3",
        "Level":  "Level 2",
        "Description":  "The organization has implemented an active discovery tool that identifies some, but not all, connected assets on their network. The tool is configured to execute daily.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG1.3",
        "Level":  "Level 3",
        "Description":  "The organization utilizes an active discovery tool that identifies the vast majority of connected assets on their network. The tool executes nightly or more frequently, and results are reviewed regularly by IT staff.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG1.3",
        "Level":  "Level 4",
        "Description":  "The organization has implemented a comprehensive active discovery tool that identifies all connected assets on their network in real-time. The tool is configured to execute daily, and results are reviewed immediately upon completion, with all findings documented and acted upon promptly.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG1.4",
        "Level":  "Level 1",
        "Description":  "No DHCP logging is used on any DHCP servers or IP address management tools, and the enterprise asset inventory remains outdated.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG1.4",
        "Level":  "Level 2",
        "Description":  "Some DHCP servers or IP address management tools are configured for DHCP logging, but logs are not reviewed or updated regularly to inform asset inventory updates.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG1.4",
        "Level":  "Level 3",
        "Description":  "DHCP logging is enabled on all relevant systems, and logs are reviewed at least weekly to update the enterprise\u0027s asset inventory. However, some log entries may be missing or incomplete.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG1.4",
        "Level":  "Level 4",
        "Description":  "All DHCP servers and IP address management tools use DHCP logging, and logs are thoroughly reviewed and updated daily to ensure accuracy in the enterprise\u0027s asset inventory.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.4",
        "Level":  "Level 1",
        "Description":  "The organization does not have a process in place to utilize automated software inventory tools. Software installations and updates are not tracked or documented.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.4",
        "Level":  "Level 2",
        "Description":  "The organization has some awareness of the need for software inventory management but lacks a formal process. Employees may manually track installed software, but this is not a systematic effort.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.4",
        "Level":  "Level 3",
        "Description":  "The organization has begun to utilize automated software inventory tools in select areas or departments. While there is an effort to automate discovery and documentation, the scope is limited and not enterprise-wide.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.4",
        "Level":  "Level 4",
        "Description":  "The organization fully utilizes automated software inventory tools throughout the enterprise to discover and document installed software. All software installations, updates, and configurations are tracked and managed in a systematic and comprehensive manner.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.6",
        "Level":  "Level 1",
        "Description":  "There is no Allowlist Authorized Libraries control in place to ensure only authorized software libraries load into a system process.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.6",
        "Level":  "Level 2",
        "Description":  "An allowlist has been created, but it is not regularly reviewed or updated, and there are known vulnerabilities that have not been patched. Authorized libraries may still be vulnerable to exploitation.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.6",
        "Level":  "Level 3",
        "Description":  "An allowlist has been implemented and periodically reviewed (e.g., quarterly), but unauthorized libraries are occasionally allowed to load into a system process. The allowlist is being kept up-to-date, but there is a lack of consistency in its application.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.6",
        "Level":  "Level 4",
        "Description":  "A regularly updated Allowlist Authorized Libraries control is in place, ensuring only authorized software libraries load into a system process. Bi-annual reassessment and review ensure the list remains accurate and effective, with no unauthorized libraries allowed to load into the system process.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.11",
        "Level":  "Level 1",
        "Description":  "No remote wipe capability exists on enterprise-owned portable end-user devices, and there is no process in place to recover deleted or unauthorized data.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.11",
        "Level":  "Level 2",
        "Description":  "Remote wipe capability exists, but it does not work as intended, or access to the recovery tool is restricted. Data may be lost if devices are not recovered promptly.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.11",
        "Level":  "Level 3",
        "Description":  "A remote wipe capability is available and can be initiated, but there are no procedures in place for regular testing and validation of its effectiveness. Devices must still be wiped when deemed necessary.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.11",
        "Level":  "Level 4",
        "Description":  "Regular testing and validation of the remote wipe capability are performed to ensure its effectiveness. A process exists for immediate recovery of deleted or unauthorized data from lost or stolen devices, and access to the recovery tool is unrestricted.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.5",
        "Level":  "Level 1",
        "Description":  "No audit logging is implemented, leaving systems vulnerable to unauthorized access or data breaches.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.5",
        "Level":  "Level 2",
        "Description":  "Basic audit logs are collected, but lacking essential details such as event source, date, and timestamp, hindering forensic investigations.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.5",
        "Level":  "Level 3",
        "Description":  "Detailed audit logs with required elements (event source, date, username, timestamp) are collected, providing a solid foundation for forensic analysis. However, additional useful fields may be missing.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.5",
        "Level":  "Level 4",
        "Description":  "Extensive audit logging is implemented, including all necessary elements (event source, date, username, timestamp, source addresses, destination addresses), and any additional relevant information, ensuring thorough support for forensic investigations and data security.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.6",
        "Level":  "Level 1",
        "Description":  "No DNS query audit log collection process exists for enterprise assets. There is no evidence of any DNS query logging or monitoring activities in place.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.6",
        "Level":  "Level 2",
        "Description":  "Partial DNS query audit log collection exists on select enterprise assets, but not uniformly across the organization. Some assets have logs collected, while others do not.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.6",
        "Level":  "Level 3",
        "Description":  "Inadequate DNS query audit log collection is present, with logs only available for a subset of enterprise assets. Logs are not comprehensive and may not capture all DNS queries made on these assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.6",
        "Level":  "Level 4",
        "Description":  "Comprehensive DNS query audit log collection exists across all enterprise assets, ensuring that all DNS queries are logged and monitored in real-time, providing complete visibility into network activity.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.7",
        "Level":  "Level 1",
        "Description":  "There is no formal process in place to collect URL request audit logs on enterprise assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.7",
        "Level":  "Level 2",
        "Description":  "A limited number of assets have basic URL request logging capabilities, but the information is not regularly reviewed or stored securely.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.7",
        "Level":  "Level 3",
        "Description":  "A comprehensive logging policy is in place for selected enterprise assets, and the collected logs are stored securely and regularly reviewed to support incident response.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.7",
        "Level":  "Level 4",
        "Description":  "All relevant enterprise assets have implemented URL request logging capabilities, which are regularly monitored, stored securely, and used to support incident response and security monitoring efforts.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.8",
        "Level":  "Level 1",
        "Description":  "No collection or retention of command-line audit logs exists. No evidence of audit log collection is stored.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.8",
        "Level":  "Level 2",
        "Description":  "Command-line audit logs are collected from Windows, Linux and MacOS systems, but not remote administrative terminals. Log data may be incomplete or missing.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.8",
        "Level":  "Level 3",
        "Description":  "Command-line audit logs are collected from Windows, Linux, and MacOS systems, and also remote administrative terminals. Logs are retained for a reasonable period and can be analyzed to support security investigations.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.8",
        "Level":  "Level 4",
        "Description":  "All command-line audit logs from all platforms are collected, retained, and made available for analysis. Logs are stored in a centralized location with clear retention policies and can be easily retrieved to support security audits and compliance reporting.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.10",
        "Level":  "Level 1",
        "Description":  "No audit log retention process exists, and logs are not stored anywhere.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.10",
        "Level":  "Level 2",
        "Description":  "Audit logs are retained on an individual basis, but across the enterprise as a whole, no centralized storage or backup system is in place.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.10",
        "Level":  "Level 3",
        "Description":  "Audit logs are retained for the minimum required period of 90 days, and a basic log retention policy is documented. Logs may be stored locally on each asset.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.10",
        "Level":  "Level 4",
        "Description":  "A comprehensive audit log retention policy is in place, including centralized storage and backup systems across all enterprise assets. Logs are retained for the full 90-day period and are regularly reviewed and deleted as necessary.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.11",
        "Level":  "Level 1",
        "Description":  "There is no established process for conducting regular review of audit logs. This lack of structure increases the risk of missing potential threats.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.11",
        "Level":  "Level 2",
        "Description":  "Audit logs are occasionally reviewed on a case-by-case basis to detect anomalies. However, this ad-hoc approach makes it difficult to identify and address recurring issues.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.11",
        "Level":  "Level 3",
        "Description":  "A regular audit log review process is established with specific schedules (e.g., weekly). While this improves detection capabilities, the reviews are often incomplete or lack thoroughness.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.11",
        "Level":  "Level 4",
        "Description":  "Audit logs are thoroughly reviewed on a scheduled basis (e.g., weekly) and all anomalies detected. The results are documented and communicated to stakeholders to ensure timely remediation and continuous improvement of security controls.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.3",
        "Level":  "Level 1",
        "Description":  "There is no established process for conducting regular review of audit logs. This lack of structure increases the risk of missing potential threats.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.3",
        "Level":  "Level 2",
        "Description":  "A basic category-based URL filter is installed, but it only filters out the minimum level to be CIPA compliant. This does not prevent all malicious websites from being accessed.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.3",
        "Level":  "Level 3",
        "Description":  "A reputation-based URL filter is implemented that uses a third-party service to block known malicious websites. However, this filter may not be comprehensive or up-to-date, allowing some malicious sites to slip through.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.3",
        "Level":  "Level 4",
        "Description":  "A robust and comprehensive URL filter is enforced on all enterprise assets, utilizing multiple filtering technologies (e.g., category-based, reputation-based, and block list-based) that are regularly updated and monitored. All employees understand the importance of adhering to these filters.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.4",
        "Level":  "Level 1",
        "Description":  "No process exists to restrict browser and email client extensions. Unauthorized or unnecessary extensions remain installed and active.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.4",
        "Level":  "Level 2",
        "Description":  "A manual review is conducted quarterly to identify unauthorized or unnecessary extensions, but no action is taken to remove or disable them.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.4",
        "Level":  "Level 3",
        "Description":  "All employees are informed of the risk associated with unauthorized extensions, and a list of approved extensions is maintained. However, manual checks are still performed only quarterly, and some extensions may remain active.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.4",
        "Level":  "Level 4",
        "Description":  "An automated process is implemented to detect and remove unauthorized or unnecessary browser and email client plugins, extensions, and add-on applications in real-time, ensuring all systems are secure and up-to-date.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.3",
        "Level":  "Level 1",
        "Description":  "No process exists for securely managing network infrastructure.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.3",
        "Level":  "Level 2",
        "Description":  "Network infrastructure is provisioned using a basic configuration management process, but no version control is in place.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.3",
        "Level":  "Level 3",
        "Description":  "A version-controlled-infrastructure-as-code approach is used to manage network infrastructure, with regular updates and rollbacks.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.3",
        "Level":  "Level 4",
        "Description":  "Network infrastructure is fully automated, with secure configurations enforced by a centralized management system that uses version control and secure protocols like SSH and HTTPS.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.6",
        "Level":  "Level 1",
        "Description":  "No existing process in place to utilize secure network management and communication protocols.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.6",
        "Level":  "Level 2",
        "Description":  "Awareness of the need for secure protocols, but no specific measures taken to implement them.  Inbound SMB is not explicitly denied to all servers that do not have a business need.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.6",
        "Level":  "Level 3",
        "Description":  "Implementation of a limited set of secure protocols (e.g., WPA2), but not consistently enforced across all devices.  Inbound SMB is explicitly denied to all servers except when a business need exists.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.6",
        "Level":  "Level 4",
        "Description":  "All network management and communication activities utilizing secure protocols (e.g., 802.1X, WPA2 Enterprise or greater) consistently enforced across all devices and environments.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.7",
        "Level":  "Level 1",
        "Description":  "No VPN or AAA infrastructure in place; no remote device access controls.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.7",
        "Level":  "Level 2",
        "Description":  "Basic VPN connectivity available, but no centralized authentication service; users may bypass authentication.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.7",
        "Level":  "Level 3",
        "Description":  "Enterprise-managed VPN and AAA infrastructure are implemented, with basic authentication capabilities.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.7",
        "Level":  "Level 4",
        "Description":  "All enterprise resources can be accessed securely via the VPN, with robust authentication and authorization across all remote devices.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.2",
        "Level":  "Level 1",
        "Description":  "The organization is not utilizing any form of host-based intrusion detection solution to monitor its systems for signs of unauthorized activity or malicious intent, leaving it vulnerable to potential security threats.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.2",
        "Level":  "Level 2",
        "Description":  "A basic host-based intrusion detection system is deployed on selected enterprise assets, but does not include advanced features such as anomaly detection or incident response capabilities. This limited deployment may provide some protection, but does not offer comprehensive security monitoring.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.2",
        "Level":  "Level 3",
        "Description":  "An advanced host-based intrusion detection system is deployed on all enterprise assets, including features such as anomaly detection and incident response capabilities. However, some configuration options are not fully utilized or enabled, which can result in missed potential threats and reduced effectiveness of the solution.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.2",
        "Level":  "Level 4",
        "Description":  "All enterprise assets have a comprehensive host-based intrusion detection solution deployed and configured to provide real-time monitoring, anomaly detection, incident response, and reporting capabilities. All necessary configuration options are enabled and utilized to ensure optimal security posture, providing robust protection against a wide range of potential threats.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.3",
        "Level":  "Level 1",
        "Description":  "No network intrusion detection solution is deployed on enterprise assets, leaving them vulnerable to potential security threats.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.3",
        "Level":  "Level 2",
        "Description":  "A basic Network Intrusion Detection System (NIDS) is deployed, but its coverage and configuration are insufficient to provide adequate protection against known threats.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.3",
        "Level":  "Level 3",
        "Description":  "An NIDS or equivalent CSP service is deployed on some enterprise assets, such as perimeter networks, but not all critical systems or data centers. Gaps remain in coverage and detection capabilities.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.3",
        "Level":  "Level 4",
        "Description":  "A comprehensive network intrusion detection solution is deployed on all enterprise assets, including critical systems and data centers, with regular monitoring, analysis, and incident response to ensure effective protection against known threats.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.4",
        "Level":  "Level 1",
        "Description":  "No traffic filtering is performed between network segments, allowing unfiltered traffic to pass freely and potentially exposing the network to unauthorized access.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.4",
        "Level":  "Level 2",
        "Description":  "Traffic filtering is partially implemented on a limited number of segments, but not consistently or comprehensively across all segments, leaving some vulnerabilities open.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.4",
        "Level":  "Level 3",
        "Description":  "Traffic filtering is implemented on most network segments, with rules in place to block suspicious traffic and limit lateral movement, but gaps may exist due to incomplete configuration or lack of monitoring.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.4",
        "Level":  "Level 4",
        "Description":  "Consistent and comprehensive traffic filtering is performed between all network segments, using robust and regularly updated rule sets, and monitored for effectiveness, ensuring a secure network environment",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.5",
        "Level":  "Level 1",
        "Description":  "No access control measures exist to manage remote assets connecting to enterprise resources. Remote assets have unrestricted access to enterprise resources, posing significant security risks.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.5",
        "Level":  "Level 2",
        "Description":  "A basic anti-malware software is installed on remote assets, but configuration compliance with the secure configuration process and operating system/applications updates are not ensured. This leaves the remote assets vulnerable to various threats.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.5",
        "Level":  "Level 3",
        "Description":  "Remote assets have up-to-date anti-malware software installed and are configured to comply with the enterprise\u0027s secure configuration process. However, some operating system and application updates may be missing or outdated, introducing potential security risks.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.5",
        "Level":  "Level 4",
        "Description":  "All remote assets connecting to enterprise resources have up-to-date anti-malware software installed, are fully configured to comply with the secure configuration process, and have all operating system and application updates applied.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.6",
        "Level":  "Level 1",
        "Description":  "No process exists for collecting network traffic flow logs or alerts, and no measures are in place to monitor and review network activity.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.6",
        "Level":  "Level 2",
        "Description":  "Network traffic is collected, but only from a limited set of devices. Logs are not reviewed regularly, and no alerts are implemented to notify system administrators of unusual activity.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.6",
        "Level":  "Level 3",
        "Description":  "Network traffic flow logs are collected from all critical devices, and regular review occurs (e.g., daily). Basic alert thresholds are also established to notify system administrators of potential security incidents.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.6",
        "Level":  "Level 4",
        "Description":  "All network traffic is collected and logged by device, with detailed analysis and alerts implemented. Logs are reviewed regularly, and advanced threat detection capabilities are utilized to identify potential security threats in real-time.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.3",
        "Level":  "Level 1",
        "Description":  "There is no established process for performing root cause analysis on security vulnerabilities.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.3",
        "Level":  "Level 2",
        "Description":  "Development teams have some awareness of root cause analysis but do not regularly apply it to fix underlying issues. They focus solely on fixing individual vulnerabilities as they arise.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.3",
        "Level":  "Level 3",
        "Description":  "Development teams perform basic root cause analysis when reviewing vulnerabilities, identifying the issue and sometimes its impact. However, they often fail to address the underlying causes of vulnerabilities.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.3",
        "Level":  "Level 4",
        "Description":  "Development teams consistently apply comprehensive root cause analysis on all security vulnerabilities, identifying and addressing the underlying issues that create vulnerabilities in code, ensuring a more secure and resilient system.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG17.7",
        "Level":  "Level 1",
        "Description":  "No incident response exercises have been conducted in the past year or ever since the control\u0027s implementation.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG17.7",
        "Level":  "Level 2",
        "Description":  "Incident response exercises are performed, but they only test specific aspects such as communication channels and not decision making and workflows.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG17.7",
        "Level":  "Level 3",
        "Description":  "Routine incident response exercises are conducted annually to test all necessary components of the incident response process, including communication channels, decision making, and workflows.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG17.7",
        "Level":  "Level 4",
        "Description":  "Comprehensive incident response exercises are conducted quarterly to test all aspects of the incident response process, ensuring key personnel are prepared to respond to real-world incidents with confidence and efficiency.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG17.8",
        "Level":  "Level 1",
        "Description":  "No post-incident review process exists, and no lessons are learned from past incidents.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG17.8",
        "Level":  "Level 2",
        "Description":  "Some post-incident reviews occur, but details are not documented or shared with relevant parties, missing opportunities to learn and improve.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG17.8",
        "Level":  "Level 3",
        "Description":  "Regular post-incident reviews are conducted, and basic incident data is documented. However, no follow-up action is taken on lessons learned, leading to potential recurrence of similar incidents.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG17.8",
        "Level":  "Level 4",
        "Description":  "Post-incident reviews are thorough, complete, and timely, with lessons learned applied to prevent future incidents through well-defined follow-up actions and improvements made to processes and procedures.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.13",
        "Level":  "Level 1",
        "Description":  "No DLP solution is deployed, and data loss prevention processes do not exist. The organization is vulnerable to data breaches and unauthorized access.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.13",
        "Level":  "Level 2",
        "Description":  "A basic DLP tool is deployed, but it only scans on-premises assets. Sensitive data transmitted through cloud services or third-party providers are not protected.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.13",
        "Level":  "Level 3",
        "Description":  "An automated DLP tool is implemented to scan all enterprise assets, including on-premises and remote service provider locations. However, the solution does not update the organization\u0027s data inventory regularly.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.13",
        "Level":  "Level 4",
        "Description":  "A comprehensive DLP solution is deployed to identify and protect all sensitive data stored, processed, or transmitted through enterprise assets, both onsite and remotely. The solution also updates the enterprise\u0027s data inventory in real-time to ensure accurate tracking of sensitive data.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.12",
        "Level":  "Level 1",
        "Description":  "No separation between enterprise workspaces on mobile end-user devices. All applications and data are accessible, with no controls in place to separate personal and professional use.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.12",
        "Level":  "Level 2",
        "Description":  "Some mobile devices have a workspace separated from personal settings, but it\u0027s not properly configured or maintained. Employees may still access personal apps or data while connected to the enterprise network.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.12",
        "Level":  "Level 3",
        "Description":  "Separate workspaces are used on all supported mobile end-user devices, with proper configuration and maintenance. Enterprise applications and data are isolated from personal applications and data, and controls are in place to enforce separation.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG4.12",
        "Level":  "Level 4",
        "Description":  "All mobile end-user devices use a separate enterprise workspace, configured and maintained according to organizational standards. All enterprise applications and data are properly isolated from personal apps and data, with robust controls in place to prevent unauthorized access or data breaches.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.12",
        "Level":  "Level 1",
        "Description":  "No process exists to collect service provider logs, which creates a significant security risk as sensitive events may go undetected.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.12",
        "Level":  "Level 2",
        "Description":  "Logs from some service providers are collected, but only specific types of events, such as authentication and data creation events. This partial compliance still leaves gaps in incident detection.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.12",
        "Level":  "Level 3",
        "Description":  "Logs from most service providers are collected, covering a range of event types including user management and disposal events. This level demonstrates some level of oversight and security awareness.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG8.12",
        "Level":  "Level 4",
        "Description":  "Comprehensive logs from all supported service providers are collected and regularly reviewed, ensuring complete visibility into all sensitive activities and enabling swift incident response.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.7",
        "Level":  "Level 1",
        "Description":  "No deployment or maintenance of email server anti-malware protections. Email servers are vulnerable to malware attacks without any protection measures in place.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.7",
        "Level":  "Level 2",
        "Description":  "Attachment scanning is deployed on some email servers, but not all. Anti-malware signatures are not regularly updated or maintained.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.7",
        "Level":  "Level 3",
        "Description":  "Email server anti-malware protections are deployed and maintained across all email servers. Regular software updates and signature downloads ensure the effectiveness of the protection measures.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG9.7",
        "Level":  "Level 4",
        "Description":  "All email servers have implemented attachment scanning, sandboxing, and regular software updates. Anti-malware signatures are regularly updated, and the system is monitored for potential threats to ensure optimal protection against malware attacks.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.10",
        "Level":  "Level 1",
        "Description":  "No application layer filtering is performed on network traffic.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.10",
        "Level":  "Level 2",
        "Description":  "A basic filtering proxy or gateway is in place to filter out known threats, but it only allows incoming connections from trusted sources.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.10",
        "Level":  "Level 3",
        "Description":  "An advanced application layer firewall is configured to inspect and block malicious traffic at the network perimeter, including both inbound and outbound traffic.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.10",
        "Level":  "Level 4",
        "Description":  "All application layer filtering is performed using a robust and constantly updated solution, such as an intrusion prevention system (IPS), to detect and block all known threats in real-time.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.5",
        "Level":  "Level 1",
        "Description":  "No formal assessment process exists for evaluating service providers. There is no documented policy, nor any regular review or reassessment of service providers.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.5",
        "Level":  "Level 2",
        "Description":  "A basic review of service providers is conducted annually, but only a cursory examination is performed. The review focuses on high-risk providers and does not involve the use of standardized assessment reports.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.5",
        "Level":  "Level 3",
        "Description":  "A rigorous assessment process is implemented, utilizing standardized assessment reports such as SOC 2 and PCI AoC, customized questionnaires, or other rigorous processes. Annual reassessment of all service providers occurs, regardless of classification.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.5",
        "Level":  "Level 4",
        "Description":  "The enterprise maintains a comprehensive oversight process for service providers, involving regular assessments with no less frequency than annually for high-risk providers. All details in the service provider contract are carefully reviewed and evaluated against standardized assessment reports and rigorous processes.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.6",
        "Level":  "Level 1",
        "Description":  "No process exists to monitor service providers. The organization relies solely on manual reviews and does not implement any formal process to assess provider compliance.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.6",
        "Level":  "Level 2",
        "Description":  "A basic monitoring system is in place, but it only includes periodic reassessment of service provider compliance reports. Release notes are not monitored, and dark web monitoring is nonexistent.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.6",
        "Level":  "Level 3",
        "Description":  "The organization has implemented a standardized monitoring process that includes regular assessments of service provider compliance, review of release notes, and dark web monitoring to detect potential security vulnerabilities.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.6",
        "Level":  "Level 4",
        "Description":  "The enterprise has developed a comprehensive service provider management policy and implements a robust monitoring system that encompasses all aspects of provider management, including regular audits, continuous assessment of release notes, and proactive dark web monitoring to ensure ongoing compliance.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.8",
        "Level":  "Level 1",
        "Description":  "There is no dedicated computing resource for administrative work, and all administrative tasks are performed on the same network as other users.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.8",
        "Level":  "Level 2",
        "Description":  "Administrative resources are physically separated from the enterprise\u0027s primary network in a separate room or closet. However, internet access is still allowed.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.8",
        "Level":  "Level 3",
        "Description":  "Administrative resources are logically separated from the enterprise\u0027s primary network using firewalls and access controls. Internet access is still possible through certain ports or protocols.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG12.8",
        "Level":  "Level 4",
        "Description":  "Dedicated computing resources are both physically and logically separated from the enterprise\u0027s primary network, with all administrative tasks performed on isolated systems that do not allow internet access under any circumstances.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.7",
        "Level":  "Level 1",
        "Description":  "No host-based intrusion prevention solution is deployed on any enterprise asset.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.7",
        "Level":  "Level 2",
        "Description":  "Host-based intrusion prevention solution is not deployed, but EDR clients are used on a subset of enterprise assets (e.g., high-risk systems).",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.7",
        "Level":  "Level 3",
        "Description":  "A basic host-based EDR and  IPS agent is deployed on a select group of enterprise assets (e.g., those with high-value data), but monitoring is not enabled.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.7",
        "Level":  "Level 4",
        "Description":  "All enterprise assets are protected by a fully configured and monitored host-based intrusion prevention solution, including EDR clients or host-based IPS agents.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.8",
        "Level":  "Level 1",
        "Description":  "No network intrusion prevention solution is deployed on any networks.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.8",
        "Level":  "Level 2",
        "Description":  "A basic NIPS or CSP service is deployed, but lacks advanced threat detection and response capabilities.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.8",
        "Level":  "Level 3",
        "Description":  "A NIPS or CSP service is deployed that meets minimum requirements for detection of known threats.  Advanced threat protection, incident response, and logging are not all in use.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.8",
        "Level":  "Level 4",
        "Description":  "All necessary features are enabled and monitored in the network intrusion prevention solution, including advanced threat detection, incident response, and logging.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.9",
        "Level":  "Level 1",
        "Description":  "No port-level access control is in place, allowing any device to connect to the network without authentication or authorization.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.9",
        "Level":  "Level 2",
        "Description":  "A basic port-level access control system is deployed using MAC address filtering only.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.9",
        "Level":  "Level 3",
        "Description":  "A basic port-level access control system is deployed using 802.1x protocol, with user authentication in place but no device authentication.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.9",
        "Level":  "Level 4",
        "Description":  "All details of this control are met, with a comprehensive port-level access control system deployed using the latest 802.1x protocols, with both user and device authentication enabled, regularly monitored and updated to ensure maximum security.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.11",
        "Level":  "Level 1",
        "Description":  "No process exists for tuning security event alerting thresholds, resulting in potential false positives and missed security incidents.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.11",
        "Level":  "Level 2",
        "Description":  "Security event alerting thresholds are occasionally reviewed quarterly, but no adjustments are made to prevent excessive alerts or false positives.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.11",
        "Level":  "Level 3",
        "Description":  "Security event alerting thresholds are regularly reviewed monthly, with some adjustments made to prevent excessive alerts. Thresholds are aligned with incident response requirements.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG13.11",
        "Level":  "Level 4",
        "Description":  "All security event alerting thresholds are carefully monitored and adjusted more frequently than monthly to ensure optimal sensitivity and specificity, aligning with incident response requirements and regulatory requirements.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.7",
        "Level":  "Level 1",
        "Description":  "No process exists to securely decommission service providers, leaving enterprise data exposed and potentially accessible to unauthorized parties.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.7",
        "Level":  "Level 2",
        "Description":  "A basic decommissioning process is in place, including user and service account deactivation, but data disposal and termination of data flows are not thoroughly documented or implemented.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.7",
        "Level":  "Level 3",
        "Description":  "A comprehensive decommissioning process is established, including secure disposal of enterprise data within service provider systems, termination of data flows, and regular audits to ensure all data has been removed. However, documentation may be incomplete.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG15.7",
        "Level":  "Level 4",
        "Description":  "All aspects of the decommissioning process are thoroughly documented, implemented, and regularly audited, ensuring that enterprise data is securely disposed of, data flows are terminated, and service provider accounts are deactivated in a timely and controlled manner.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG18.5",
        "Level":  "Level 1",
        "Description":  "No periodic internal penetration tests are performed. There is no documented process for conducting security assessments. Program risks and vulnerabilities are not evaluated.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG18.5",
        "Level":  "Level 2",
        "Description":  "Internal penetration tests are conducted annually, but only as required by program management. The scope of testing is unclear, and results are not consistently communicated to stakeholders.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG18.5",
        "Level":  "Level 3",
        "Description":  "Periodic internal penetration tests are performed two or three times annually, using a standardized framework that includes clear box and opaque box testing methods. Test results are documented, but their frequency and thoroughness vary across the organization.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG18.5",
        "Level":  "Level 4",
        "Description":  "Regular internal penetration tests are conducted at least quarterly to ensure ongoing program security posture. Testing is performed using clear box and opaque box methods, and test results are thoroughly reviewed and communicated to stakeholders on a regular basis.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG1.5",
        "Level":  "Level 1",
        "Description":  "No passive asset discovery tool is used to identify assets connected to the enterprise\u0027s network. The enterprise\u0027s asset inventory remains unchanged.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG1.5",
        "Level":  "Level 2",
        "Description":  "A passive asset discovery tool is used, but scans are not conducted regularly, resulting in an outdated or incomplete asset inventory. This level acknowledges some effort, but does not ensure accurate identification of assets.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG1.5",
        "Level":  "Level 3",
        "Description":  "Passive asset discovery tools are used to identify and update the enterprise\u0027s asset inventory on a weekly basis, with additional frequent checks as needed. The inventory is considered reasonably up-to-date, but may require occasional review for accuracy.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG1.5",
        "Level":  "Level 4",
        "Description":  "A passive asset discovery tool is continuously monitored, and scans are conducted frequently (e.g., daily) to maintain an accurate and up-to-date enterprise-wide asset inventory. This level ensures comprehensive identification and management of all assets connected to the network.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.7",
        "Level":  "Level 1",
        "Description":  "No technical controls exist to ensure authorized scripts only execute. Unrestricted script execution poses a significant risk to the organization.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.7",
        "Level":  "Level 2",
        "Description":  "A basic allowlist is implemented using simple text-based filtering, but no digital signatures or version control are used. Unauthorized scripts may still be executed with minimal risk.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.7",
        "Level":  "Level 3",
        "Description":  "Digital signatures and version control are in place, allowing authorized scripts to execute while unauthorized ones are blocked. The allowlist is regularly reviewed and updated bi-annually. Risk is minimized but not eliminated.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG2.7",
        "Level":  "Level 4",
        "Description":  "Technical controls are comprehensive, ensuring only authorized scripts execute. Digital signatures, version control, and regular reviews more frequently than bi-annually guarantee the accuracy of the allowlist. All risk associated with unauthorized script execution has been mitigated.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.14",
        "Level":  "Level 1",
        "Description":  "No formal process exists to log sensitive data access, modification, or disposal. Insiders may view sensitive information without adequate controls.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.14",
        "Level":  "Level 2",
        "Description":  "A basic logging mechanism is in place, but it only captures general access details (e.g., timestamp, user ID). Sensitive data modifications and dispositions are not tracked.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.14",
        "Level":  "Level 3",
        "Description":  "An enhanced monitoring system logs all sensitive data access, modification, and disposal activities. Alerts and notifications are generated for suspicious activity, and audit trails are maintained for regulatory compliance.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG3.14",
        "Level":  "Level 4",
        "Description":  "A comprehensive logging system tracks every sensitive data access, modification, and disposal activity, including user authentication, IP addresses, and file modifications. Automated alerts and reports ensure all security events are thoroughly investigated and documented.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.8",
        "Level":  "Level 1",
        "Description":  "The organization does not have a role-based access control (RBAC) process in place, nor do they document the necessary access rights for each role.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.8",
        "Level":  "Level 2",
        "Description":  "The organization has a basic RBAC framework in place, but lacks documentation of access rights and performs annual reviews of enterprise assets. Privileges are not consistently validated.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.8",
        "Level":  "Level 3",
        "Description":  "The organization maintains a well-defined RBAC process with documented access rights for each role. Access control reviews of enterprise assets are performed quarterly or more frequently to validate authorized privileges.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG6.8",
        "Level":  "Level 4",
        "Description":  "The organization has a comprehensive RBAC framework in place, including regular review cycles (e.g., monthly) and automated checks to validate authorized privileges. All access rights are thoroughly documented and easily accessible for auditing purposes.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.12",
        "Level":  "Level 1",
        "Description":  "No code-level security checks are implemented, leaving applications vulnerable to known vulnerabilities and insecure coding practices.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.12",
        "Level":  "Level 2",
        "Description":  "Static analysis tools are applied within the application life cycle, but dynamic analysis is not performed. Some secure coding practices are followed, but weaknesses remain.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.12",
        "Level":  "Level 3",
        "Description":  "Both static and dynamic analysis tools are used to verify secure coding practices. Regular security audits identify areas for improvement, ensuring a baseline level of security.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.12",
        "Level":  "Level 4",
        "Description":  "All aspects of code-level security checks are met, with regular and thorough application of both static and dynamic analysis tools. Secure coding best practices are consistently followed, providing robust protection against known vulnerabilities.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.13",
        "Level":  "Level 1",
        "Description":  "No penetration testing is performed, either authenticated or non-authenticated. Critical applications remain vulnerable to business logic attacks.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.13",
        "Level":  "Level 2",
        "Description":  "Non-authenticated penetration testing is conducted, but not all critical applications are tested. This may leave some vulnerabilities unexplored and potentially exploited.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.13",
        "Level":  "Level 3",
        "Description":  "Authenticated penetration testing is conducted on all critical applications, providing a comprehensive view of potential business logic vulnerabilities. However, non-authenticated testing may be lacking for certain applications.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.13",
        "Level":  "Level 4",
        "Description":  "All critical applications undergo both authenticated and non-authenticated penetration testing, ensuring that all potential vulnerabilities are identified and addressed.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.14",
        "Level":  "Level 1",
        "Description":  "No threat modeling process exists within the organization, leaving applications vulnerable to security risks. There is no evaluation or assessment of design flaws, and security risks are not identified.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.14",
        "Level":  "Level 2",
        "Description":  "A basic threat model is created, but it lacks thoroughness and rigor. Only high-risk areas are evaluated, and some potential vulnerabilities are overlooked. Security risks are partially addressed, but weaknesses remain unmitigated.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.14",
        "Level":  "Level 3",
        "Description":  "A comprehensive threat model is developed, evaluating all entry points and access levels. The assessment identifies significant security risks and addresses them through design changes or mitigation strategies. However, some minor vulnerabilities may still exist.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG16.14",
        "Level":  "Level 4",
        "Description":  "A rigorous threat modeling process is employed, identifying and addressing all potential security risks within the application design. Every aspect of the application architecture and infrastructure is evaluated, and weaknesses are thoroughly addressed through multiple layers of defense and countermeasures.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG18.4",
        "Level":  "Level 1",
        "Description":  "The organization has no formal process in place to validate security measures after each penetration test.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG18.4",
        "Level":  "Level 2",
        "Description":  "After each penetration test, the organization reviews the results and provides feedback on security measures. However, no modifications are made to rulesets or capabilities.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG18.4",
        "Level":  "Level 3",
        "Description":  "Following each penetration test, the organization validates security measures against known threats and modifies rulesets and capabilities as needed to detect new techniques. This ensures that security measures remain effective.",
        "TypeID":  "1"
    },
    {
        "SafeguardID":  "SG18.4",
        "Level":  "Level 4",
        "Description":  "The organization has a formal process in place to validate security measures after each penetration test. Modifications are made to rulesets and capabilities, and the results are continuously reviewed and updated to ensure maximum effectiveness.",
        "TypeID":  "1"
    }
]
